org/blog/2021/arch-software-installation-and-usage.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: Arch 软件安装和用法

** 隐藏 GRUB 加载
   :PROPERTIES:
   :CUSTOM_ID: 隐藏-grub-加载
   :END:
尝试过这种办法[fn:1]，没起作用；然后尝试这一个[fn:2]成功了：

#+begin_example
  sudo vim /etc/default/grub
  sudo grub-mkconfig -o /boot/grub/grub.cfg
#+end_example

修改 =etc/default/grub=:

#+begin_example
  -GRUB_TIMEOUT=1
  +GRUB_TIMEOUT=0
#+end_example

** 挂载
   :PROPERTIES:
   :CUSTOM_ID: 挂载
   :END:
挂载外来文件系统，推荐使用 udiskctl(install udisks2,
=pkgfile -b udisksctl=) 命令，很多时候不需要 root
权限就能挂载和卸载[fn:3]。

** Reflector 更新镜像[fn:4]
   :PROPERTIES:
   :CUSTOM_ID: reflector-更新镜像 4
   :END:
*** 开机自动执行
    :PROPERTIES:
    :CUSTOM_ID: 开机自动执行
    :END:
=/etc/xdg/reflector/reflector.conf=:

#+begin_example
  --save /etc/pacman.d/mirrorlist
  --country China
  --protocol https
  --latest 5
#+end_example

#+begin_example
  systemctl enable reflector
  systemctl start reflector
#+end_example

*** 通过 Pacman hook 自动化以上步骤
    :PROPERTIES:
    :CUSTOM_ID: 通过-pacman-hook-自动化以上步骤
    :END:
=/etc/pacman.d/hooks/mirrorupgrade.hook=:

#+begin_example
  [Trigger]
  Operation = Upgrade
  Type = Package
  Target = pacman-mirrorlist

  [Action]
  Description = Updating pacman-mirrorlist with reflector and removing pacnew...
  When = PostTransaction
  Depends = reflector
  Exec = /bin/sh -c 'systemctl start reflector.service; [ -f /etc/pacman.d/mirrorlist.pacnew ] && rm /etc/pacman.d/mirrorlist.pacnew'
#+end_example

*** 设置代理
    :PROPERTIES:
    :CUSTOM_ID: 设置代理
    :END:
*** Clash
    :PROPERTIES:
    :CUSTOM_ID: clash
    :END:
#+begin_example
  export CLASH_VERSION="1.6.5"
  wget -O clash.gz https://github.com/Dreamacro/clash/releases/download/v${CLASH_VERSION}/clash-linux-amd64-v${CLASH_VERSION}.gz
  gzip -f clash.gz -d
  sudo mv ~/clash /usr/local/bin/clash
  chmod +x /usr/local/bin/clash
  clash # Generate config.yaml, Country.mmdb in ~/.config/clash
  ## download yaml file from your service provider, rename it to config.yaml, put it under your clash folder

  # open clash at start https://github.com/Dreamacro/clash/wiki/clash-as-a-daemon
  sudo vim /etc/systemd/system/clash.service
#+end_example

=/etc/systemd/system/clash.service=:

#+begin_example
  [Unit]
  Description=Clash daemon, A rule-based proxy in Go.
  After=network.target

  [Service]
  Type=simple
  Restart=always
  ExecStart=/usr/local/bin/clash -d "/home/archie/.config/clash"

  [Install]
  WantedBy=multi-user.target
#+end_example

测试代理是否有效（脚本不起作用）[fn:5]：

#+begin_example
  # 来自「依云」https://blog.lilydjwg.me
  def test_youtube(port: int) -Union[str, bool]:
    output = subprocess.check_output([
      'curl', '-sS', '-m30', '-H', 'Accept-Language: en',
      'https://www.youtube.com/premium', '--socks5-hostname', f'localhost:{port}',
    ], text=True)
    if 'Premium is not available in your country' in output:
      return False
    m = re.search(r'countryCode":"(\w+)', output)
    if m:
      return m.group(1)
    else:
      return 'US'
#+end_example

** 输入法配置[fn:6]
   :PROPERTIES:
   :CUSTOM_ID: 输入法配置 6
   :END:
想把 ibus 移除，只使用 fcitx。后来发现 ibus 被很多程序依赖无法删除。

#+begin_example
  sudo pacman -S fcitx-im fcitx-configtool fcitx-googlepinyin
#+end_example

Add support for gtk,qt:

添加对 gtk，qt 类（指通过 gtk、qt 编程得到的软件）软件的支持：

#+begin_example
  # /etc/profile
  export XMODIFIERS="@im=fcitx"
  export GTK_IM_MODULE="fcitx"
  export QT_IM_MODULE="fcitx"
#+end_example

升级 fcitx 版本 4->5，并安装词库、主题：

#+begin_example
  sudo pacman -Rsc fcitx
  sudo pacman -S fcitx5-im fcitx5-chinese-addons fcitx5-pinyin-zhwiki fcitx5-material-color
#+end_example

配置开机启动；主题：material-color-black

*** fcitx5 使用发现
    :PROPERTIES:
    :CUSTOM_ID: fcitx5-使用发现
    :END:
=Enter= 回车键异常：中文模式下，按 ； 后再按 Enter
无法输入英文分号。可能不是问题，刚从 fcitx4 升级到 fcitx5。

经过这些时间的磨合，发现：这的确是一个
bug。过段时间，我改变了想法，想到这可能是因为不同软件之间 =Enter=
键的作用不同造成的。

** 字体[fn:7]
   :PROPERTIES:
   :CUSTOM_ID: 字体 7
   :END:
使用的是以前用过的 GNOME 桌面环境的默认字体设置：

- Cantarell Regular 11
- Source Code Pro Regular 10
- Cantarell Bold 11

所有安装的字体：

#+begin_example
  sudo pacman -S noto-fonts noto-fonts-extra noto-fonts-emoji noto-fonts-cjk ttf-dejavu ttf-liberation ttf-roboto ttf-inconsolata ttf-linux-libertine ttf-droid adobe-source-han-sans-cn-fonts adobe-source-han-serif-cn-fonts
  yay -S otf-eb-garamond ttf-monaco otf-san-francisco consolas-font
#+end_example

中文：

noto-fonts, noto-fonts-cjk, noto-fonts-emoji, noto-fonts-extra

代码：

monaco, menlo, hack, IBM Plex Mono

- 命令行安装的字体所在的目录：=/usr/share/fonts/=
- 手动安装的字体所在的目录：=~/.local/share/fonts/=

#+begin_example
  fc-cache -fv # 更新字体缓存
#+end_example

** 蓝牙
   :PROPERTIES:
   :CUSTOM_ID: 蓝牙
   :END:
#+begin_example
  sudo systemctl enable --now bluetooth
#+end_example

** Git
   :PROPERTIES:
   :CUSTOM_ID: git
   :END:
#+begin_example
  wget -O ~/.gitconfig https://github.com/tianheg/dotfiles/raw/main/gitconfig
  # 不要忘记 commit.gpgsign true

  ## SSH
  chmod 400 ~/.ssh/id_ed25519
  # 解决 sign_and_send_pubkey: signing failed for ED25519 "/home/user/.ssh/id_ed25519" from agent: agent refused operation; git@github.com: Permission denied (publickey).
#+end_example

** GPG
   :PROPERTIES:
   :CUSTOM_ID: gpg
   :END:
修改 =~/.gnupg/= 权限：

#+begin_example
  # https://superuser.com/a/954536 ; https://superuser.com/a/954639
  # Set ownership to your own user and primary group
  chown -R "$USER:$(id -gn)" ~/.gnupg
  # Set permissions to read, write, execute for only yourself, no others
  chmod 700 ~/.gnupg
  # Set permissions to read, write for only yourself, no others
  chmod 600 ~/.gnupg/*
#+end_example

这几条命令解决
=gpg: WARNING: unsafe permissions on homedir '/home/user/.gnupg'=。

*把 ~/.gnupg 文件夹保存在安全的地方*，然后导入公匙 GitHub(user +
web-flow)：

#+begin_example
  wget -O tianheg-pubkeys.txt https://github.com/tianheg.gpg
  wget -O github-web-flow.txt https://github.com/web-flow.gpg
  gpg --import tianheg-pubkeys.txt
  gpg --import github-web-flow.txt
#+end_example

** 键盘映射[fn:8]
   :PROPERTIES:
   :CUSTOM_ID: 键盘映射 17
   :END:
把上下左右建映射到字母键：

#+begin_example
  vim ~/ijkl
  xmodmap ~/ijkl
#+end_example

=ijkl=:

#+begin_example
  keycode 66 = Mode_switch
  keysym j = j J Left
  keysym l = l L Right
  keysym i = i I Up
  keysym k = k K Down
#+end_example

但是，在做完以上步骤后，我的 Left Ctrl -> CapsLock
的映射失效了，所以我需要修改文件内容。

让一切恢复之前的状态的命令：=setxkbmap -layout us=。

