blog/2021/arch-software-installation-and-usage.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-01-16 Sun 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Arch 软件安装和用法</title>
<meta name="generator" content="Org mode">
<link rel="preconnect" href="https://fonts.googleapis.com"><link rel="preconnect" href="https://fonts.gstatic.com" crossorigin><link href="https://fonts.googleapis.com/css2?family=Noto+Sans+SC&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/theme/normalize.css"/>
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Arch 软件安装和用法</h1>
</header>
<div id="outline-container-隐藏-grub-加载" class="outline-2">
<h2 id="隐藏-grub-加载">隐藏 GRUB 加载</h2>
<div class="outline-text-2" id="text-隐藏-grub-加载">
<p>
尝试过这种办法<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>，没起作用；然后尝试这一个<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>成功了：
</p>

<pre class="example" id="org30d2401">
sudo vim /etc/default/grub
sudo grub-mkconfig -o /boot/grub/grub.cfg
</pre>

<p>
修改 <code>etc/default/grub</code>:
</p>

<pre class="example" id="orgada7ce6">
-GRUB_TIMEOUT=1
+GRUB_TIMEOUT=0
</pre>
</div>
</div>

<div id="outline-container-挂载" class="outline-2">
<h2 id="挂载">挂载</h2>
<div class="outline-text-2" id="text-挂载">
<p>
挂载外来文件系统，推荐使用 udiskctl(install udisks2,
<code>pkgfile -b udisksctl</code>) 命令，很多时候不需要 root
权限就能挂载和卸载<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>。
</p>
</div>
</div>

<div id="outline-container-reflector-更新镜像 4" class="outline-2">
<h2 id="reflector-更新镜像 4">Reflector 更新镜像<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></h2>
<div class="outline-text-2" id="text-reflector-更新镜像 4">
</div>
<div id="outline-container-开机自动执行" class="outline-3">
<h3 id="开机自动执行">开机自动执行</h3>
<div class="outline-text-3" id="text-开机自动执行">
<p>
<code>/etc/xdg/reflector/reflector.conf</code>:
</p>

<pre class="example" id="org8b46d46">
--save /etc/pacman.d/mirrorlist
--country China
--protocol https
--latest 5
</pre>

<pre class="example" id="org7668400">
systemctl enable reflector
systemctl start reflector
</pre>
</div>
</div>

<div id="outline-container-通过-pacman-hook-自动化以上步骤" class="outline-3">
<h3 id="通过-pacman-hook-自动化以上步骤">通过 Pacman hook 自动化以上步骤</h3>
<div class="outline-text-3" id="text-通过-pacman-hook-自动化以上步骤">
<p>
<code>/etc/pacman.d/hooks/mirrorupgrade.hook</code>:
</p>

<pre class="example" id="org7d9ac1f">
[Trigger]
Operation = Upgrade
Type = Package
Target = pacman-mirrorlist

[Action]
Description = Updating pacman-mirrorlist with reflector and removing pacnew...
When = PostTransaction
Depends = reflector
Exec = /bin/sh -c 'systemctl start reflector.service; [ -f /etc/pacman.d/mirrorlist.pacnew ] &amp;&amp; rm /etc/pacman.d/mirrorlist.pacnew'
</pre>
</div>
</div>

<div id="outline-container-设置代理" class="outline-3">
<h3 id="设置代理">设置代理</h3>
<div class="outline-text-3" id="text-设置代理">
</div>
</div>
<div id="outline-container-clash" class="outline-3">
<h3 id="clash">Clash</h3>
<div class="outline-text-3" id="text-clash">
<pre class="example" id="org11438e9">
export CLASH_VERSION="1.6.5"
wget -O clash.gz https://github.com/Dreamacro/clash/releases/download/v${CLASH_VERSION}/clash-linux-amd64-v${CLASH_VERSION}.gz
gzip -f clash.gz -d
sudo mv ~/clash /usr/local/bin/clash
chmod +x /usr/local/bin/clash
clash # Generate config.yaml, Country.mmdb in ~/.config/clash
## download yaml file from your service provider, rename it to config.yaml, put it under your clash folder

# open clash at start https://github.com/Dreamacro/clash/wiki/clash-as-a-daemon
sudo vim /etc/systemd/system/clash.service
</pre>

<p>
<code>/etc/systemd/system/clash.service</code>:
</p>

<pre class="example" id="org8fe63ec">
[Unit]
Description=Clash daemon, A rule-based proxy in Go.
After=network.target

[Service]
Type=simple
Restart=always
ExecStart=/usr/local/bin/clash -d "/home/archie/.config/clash"

[Install]
WantedBy=multi-user.target
</pre>

<p>
测试代理是否有效（脚本不起作用）<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>：
</p>

<pre class="example" id="orgf840480">
# 来自「依云」https://blog.lilydjwg.me
def test_youtube(port: int) -Union[str, bool]:
  output = subprocess.check_output([
    'curl', '-sS', '-m30', '-H', 'Accept-Language: en',
    'https://www.youtube.com/premium', '--socks5-hostname', f'localhost:{port}',
  ], text=True)
  if 'Premium is not available in your country' in output:
    return False
  m = re.search(r'countryCode":"(\w+)', output)
  if m:
    return m.group(1)
  else:
    return 'US'
</pre>
</div>
</div>
</div>

<div id="outline-container-输入法配置 6" class="outline-2">
<h2 id="输入法配置 6">输入法配置<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup></h2>
<div class="outline-text-2" id="text-输入法配置 6">
<p>
想把 ibus 移除，只使用 fcitx。后来发现 ibus 被很多程序依赖无法删除。
</p>

<pre class="example" id="org3a61bc7">
sudo pacman -S fcitx-im fcitx-configtool fcitx-googlepinyin
</pre>

<p>
Add support for gtk,qt:
</p>

<p>
添加对 gtk，qt 类（指通过 gtk、qt 编程得到的软件）软件的支持：
</p>

<pre class="example" id="org3608cb0">
# /etc/profile
export XMODIFIERS="@im=fcitx"
export GTK_IM_MODULE="fcitx"
export QT_IM_MODULE="fcitx"
</pre>

<p>
升级 fcitx 版本 4-&gt;5，并安装词库、主题：
</p>

<pre class="example" id="orgd60809c">
sudo pacman -Rsc fcitx
sudo pacman -S fcitx5-im fcitx5-chinese-addons fcitx5-pinyin-zhwiki fcitx5-material-color
</pre>

<p>
配置开机启动；主题：material-color-black
</p>
</div>

<div id="outline-container-fcitx5-使用发现" class="outline-3">
<h3 id="fcitx5-使用发现">fcitx5 使用发现</h3>
<div class="outline-text-3" id="text-fcitx5-使用发现">
<p>
<code>Enter</code> 回车键异常：中文模式下，按 ； 后再按 Enter
无法输入英文分号。可能不是问题，刚从 fcitx4 升级到 fcitx5。
</p>

<p>
经过这些时间的磨合，发现：这的确是一个
bug。过段时间，我改变了想法，想到这可能是因为不同软件之间 <code>Enter</code>
键的作用不同造成的。
</p>
</div>
</div>
</div>

<div id="outline-container-字体 7" class="outline-2">
<h2 id="字体 7">字体<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup></h2>
<div class="outline-text-2" id="text-字体 7">
<p>
使用的是以前用过的 GNOME 桌面环境的默认字体设置：
</p>

<ul class="org-ul">
<li>Cantarell Regular 11</li>
<li>Source Code Pro Regular 10</li>
<li>Cantarell Bold 11</li>
</ul>

<p>
所有安装的字体：
</p>

<pre class="example" id="orge6edd0d">
sudo pacman -S noto-fonts noto-fonts-extra noto-fonts-emoji noto-fonts-cjk ttf-dejavu ttf-liberation ttf-roboto ttf-inconsolata ttf-linux-libertine ttf-droid adobe-source-han-sans-cn-fonts adobe-source-han-serif-cn-fonts
yay -S otf-eb-garamond ttf-monaco otf-san-francisco consolas-font
</pre>

<p>
中文：
</p>

<p>
noto-fonts, noto-fonts-cjk, noto-fonts-emoji, noto-fonts-extra
</p>

<p>
代码：
</p>

<p>
monaco, menlo, hack, IBM Plex Mono
</p>

<ul class="org-ul">
<li>命令行安装的字体所在的目录：=/usr/share/fonts/=</li>
<li>手动安装的字体所在的目录：=~/.local/share/fonts/=</li>
</ul>

<pre class="example" id="org19b2375">
fc-cache -fv # 更新字体缓存
</pre>
</div>
</div>

<div id="outline-container-蓝牙" class="outline-2">
<h2 id="蓝牙">蓝牙</h2>
<div class="outline-text-2" id="text-蓝牙">
<pre class="example" id="org249203e">
sudo systemctl enable --now bluetooth
</pre>
</div>
</div>

<div id="outline-container-git" class="outline-2">
<h2 id="git">Git</h2>
<div class="outline-text-2" id="text-git">
<pre class="example" id="orgead5782">
wget -O ~/.gitconfig https://github.com/tianheg/dotfiles/raw/main/gitconfig
# 不要忘记 commit.gpgsign true

## SSH
chmod 400 ~/.ssh/id_ed25519
# 解决 sign_and_send_pubkey: signing failed for ED25519 "/home/user/.ssh/id_ed25519" from agent: agent refused operation; git@github.com: Permission denied (publickey).
</pre>
</div>
</div>

<div id="outline-container-gpg" class="outline-2">
<h2 id="gpg">GPG</h2>
<div class="outline-text-2" id="text-gpg">
<p>
修改 <code>~/.gnupg/</code> 权限：
</p>

<pre class="example" id="orge6751b5">
# https://superuser.com/a/954536 ; https://superuser.com/a/954639
# Set ownership to your own user and primary group
chown -R "$USER:$(id -gn)" ~/.gnupg
# Set permissions to read, write, execute for only yourself, no others
chmod 700 ~/.gnupg
# Set permissions to read, write for only yourself, no others
chmod 600 ~/.gnupg/*
</pre>

<p>
这几条命令解决
=gpg: WARNING: unsafe permissions on homedir '<i>home/user</i>.gnupg'=。
</p>

<p>
*把 ~/.gnupg 文件夹保存在安全的地方*，然后导入公匙 GitHub(user +
web-flow)：
</p>

<pre class="example" id="org9f5012d">
wget -O tianheg-pubkeys.txt https://github.com/tianheg.gpg
wget -O github-web-flow.txt https://github.com/web-flow.gpg
gpg --import tianheg-pubkeys.txt
gpg --import github-web-flow.txt
</pre>
</div>
</div>

<div id="outline-container-键盘映射 17" class="outline-2">
<h2 id="键盘映射 17">键盘映射<sup><a id="fnr.8" class="footref" href="#fn.8">8</a></sup></h2>
<div class="outline-text-2" id="text-键盘映射 17">
<p>
把上下左右建映射到字母键：
</p>

<pre class="example" id="orgeb7dd45">
vim ~/ijkl
xmodmap ~/ijkl
</pre>

<p>
<code>ijkl</code>:
</p>

<pre class="example" id="orgc56a35b">
keycode 66 = Mode_switch
keysym j = j J Left
keysym l = l L Right
keysym i = i I Up
keysym k = k K Down
</pre>

<p>
但是，在做完以上步骤后，我的 Left Ctrl -&gt; CapsLock
的映射失效了，所以我需要修改文件内容。
</p>

<p>
让一切恢复之前的状态的命令：=setxkbmap -layout us=。
</p>
</div>
</div>
