org/blog/2021/arch-software-installation-and-usage.org
** pacman
   :PROPERTIES:
   :CUSTOM_ID: pacman
   :END:
Is it possible that there is a major kernel update in the repository,
and that some of the driver packages have not been updated?

No, it is not possible. Major kernel updates (e.g. linux 3.5.0-1 to
linux 3.6.0-1) are always accompanied by rebuilds of all supported
kernel driver packages. On the other hand, if you have an unsupported
driver package (e.g. from the AUR) installed on your system, then a
kernel update might break things for you if you do not rebuild it for
the new kernel. Users are responsible for updating any unsupported
driver packages that they have installed.

*** 配置 pacman
    :PROPERTIES:
    :CUSTOM_ID: 配置-pacman
    :END:
添加库 =/etc/pacman.conf=：

#+begin_example
  [archlinuxcn]
  Server = https://repo.archlinuxcn.org/$arch
#+end_example

分布在中国境内的镜像见这里[fn:9]。

导入 PGP 公匙（为了验证 archlinuxcn 库）:

#+begin_example
  sudo pacman -Syy && sudo pacman -S archlinuxcn-keyring
#+end_example

*** pacman 命令
    :PROPERTIES:
    :CUSTOM_ID: pacman-命令
    :END:
#+begin_example
  ## 常用
  pacman -Qe # List all explicitly installed packages
  pacman -Qet # list all packages explicitly installed and not required as dependencies
  pacman -Qent # List all explicitly installed native packages (i.e. present in the sync database) that are not direct or optional dependencies
  pacman -Qn # List all native packages (installed from the sync database(s))
  pacman -Qm # List all foreign packages (typically manually downloaded and installed or packages removed from the repositories)

  sudo pacman -Qtdq | sudo pacman -Rns - # recursively removing orphans and their configuration files

  sudo pacman -Qii | awk '/^MODIFIED/ {print $2}' # print modified files under /etc

  pacman -Qs regex # List packages by regex

  pacman -Qg group_name # List installed packages under this group
  pacman -Sg group # List all packages in the package group named `group`, etc, base-devel, gnome
  pacman -Qq | grep -Ee '-(bzr|cvs|darcs|git|hg|svn)$' # list all development/unstable packages
  pacman -Syu # Update package list and upgrade all packages afterwards
  pacman -Syu git # Update package list, upgrade all packages, and then install git if it wasn’t already installed

  pacman -S package_name1 package_name2 # Installing specific packages
  pacman -S $(pacman -Ssq package_regex) # Install a list of packages with regex
  pacman -S extra/package_name # Install specific repositories' package
  pacman -S plasma-{desktop,mediacenter,nm}
  pacman -S plasma-{workspace{,-wallpapers},pa}

  pacman -S gnome # Install through group of packages
  Enter a selection (default=all): 1-10 15 # which will select packages 1 through 10 and 15 for installation
  Enter a selection (default=all): ^5-8 ^2 # which will select all packages except 5 through 8 and 2 for installation

  pacman -R package_name # remove a single package, leaving all of its dependencies installed
  pacman -Rs package_name # remove a single package and its dependencies which are not required by any other installed package

  pacman -Qtd # check for packages that were installed as a dependency but now, no other packages depend on them

  pacman -Ss string1 string2 ... # search for packages in the database
  pacman -Qs string1 string2 ... # search for already installed packages
  pacman -F string1 string2 ... # search for package file names in remote packages
  pacman -Fy string1 string2 ... # first flush local cache, then search for package file names in remote packages

  pacman -Si package_name # display extensive information about a given package
  pacman -Qi package_name # display extensive information about locally installed packages
  pacman -Qii package_name # also display the list of backup files and their modification states

  pacman -Ql package_name # retrieve a list of the files installed by a package
  pacman -Fl package_name # retrieve a list of the files installed by a remote package



  ## Rarely use
  pacman -Qk package_name # verify the presence of the files installed by a package, Passing the k flag twice will perform a more thorough check
  pacman -Qo /path/to/file_name # query the database to know which package a file in the file system belongs to
  pacman -F /path/to/file_name # query the database to know which remote package a file belongs to
#+end_example

*** 应该避免执行的 pacman 指令
    :PROPERTIES:
    :CUSTOM_ID: 应该避免执行的-pacman-指令
    :END:
#+begin_example
  pacman -Sy # never run!!!
  pacman -Rdd package # never run!!!
#+end_example

在 Arch
中安装包时应避免没有升级系统就刷新包列表。这样做是为了避免出现依赖问题，比如，如果一个包被从官方仓库中移除，在进行包同步时就会报错。在实践中，不要执行
=pacman -Sy package_name=，应该执行 =pacman -Syu package_name=

*** 执行 pacman 命令过程中，遇到的信息/警告/错误
    :PROPERTIES:
    :CUSTOM_ID: 执行-pacman-命令过程中遇到的信息警告错误
    :END:
循环依赖：

#+begin_example
  warning: dependency cycle detected
#+end_example

执行 =sudo pacman -Syu= 时：

#+begin_example
  WARNING: Possibly missing firmware for module
#+end_example

这是一种警告。

参考：

1. [[https://wiki.archlinux.org/title/Mkinitcpio#Possibly_missing_firmware_for_module_XXXX]]
2. [[https://arcolinuxforum.com/viewtopic.php?t=1174]]

gpg: key 786C63F330D7CB92: no user ID for key signature packet of class
10[^0]

#+begin_example
  gpg: key 786C63F330D7CB92: no user ID for key signature packet of class 10
  gpg: key 1EB2638FF56C0C53: no user ID for key signature packet of class 10
  gpg: next trustdb check due at 2021-10-09
    -> Disabled 3 keys.

  ## try 1
  sudo pacman-key --refresh-keys
  sudo pacman -S archlinux-keyring archlinuxcn-keyring
  ## try 2
  sudo rm -R /etc/pacman.d/gnupg/ # No such file or directory
  sudo rm -rf /etc/pacman.d/gnupg/
  sudo rm -R /root/.gnupg/ 
  sudo rm -R /var/cache/pacman/pkg/
  sudo gpg --refresh-keys
  sudo pacman-key --init
  sudo pacman-key --populate archlinux # still display `gpg: key xxx: no user ID for key signature packet of class 10`
  sudo pacman-key --refresh-keys
  sudo pacman -Syyu
#+end_example

warning: /etc/pacman.d/mirrorlist installed as
/etc/pacman.d/mirrorlist.pacnew

/etc/mkinitcpio.d/linux.preset: 'default' and
/etc/mkinitcpio.d/linux.preset: 'fallback'

参考：

1. [[https://wiki.archlinux.org/title/Arch_User_Repository#Installing_and_upgrading_packages]]
2. [[https://wiki.archlinux.org/title/Frequently_asked_questions#Is_it_possible_that_there_is_a_major_kernel_update_in_the_repository,_and_that_some_of_the_driver_packages_have_not_been_updated]]?
3. [[https://wiki.archlinux.org/title/Pacman/Tips_and_tricks]]
4. [[https://wiki.archlinux.org/title/Pacman]]
5. [[https://wiki.archlinux.org/title/System_maintenance#Avoid_certain_pacman_commands]]
6. [[https://wiki.archlinux.org/title/Pacman/Rosetta]]
7. [[https://wiki.archlinux.org/title/Mkinitcpio]]

** yay
   :PROPERTIES:
   :CUSTOM_ID: yay
   :END:
Yet Another Yogurt: 又一个从 Arch User Repository 下载包的工具。

*** 安装 yay
    :PROPERTIES:
    :CUSTOM_ID: 安装-yay
    :END:
#+begin_example
  sudo pacman -S yay
  # pacman -S --needed git base-devel
  # git clone https://aur.archlinux.org/yay.git
  # cd yay
  # makepkg -si
#+end_example

