blog/2021/arch-software-installation-and-usage.html

<div id="outline-container-pacman" class="outline-2">
<h2 id="pacman">pacman</h2>
<div class="outline-text-2" id="text-pacman">
<p>
Is it possible that there is a major kernel update in the repository,
and that some of the driver packages have not been updated?
</p>

<p>
No, it is not possible. Major kernel updates (e.g. linux 3.5.0-1 to
linux 3.6.0-1) are always accompanied by rebuilds of all supported
kernel driver packages. On the other hand, if you have an unsupported
driver package (e.g. from the AUR) installed on your system, then a
kernel update might break things for you if you do not rebuild it for
the new kernel. Users are responsible for updating any unsupported
driver packages that they have installed.
</p>
</div>

<div id="outline-container-配置-pacman" class="outline-3">
<h3 id="配置-pacman">配置 pacman</h3>
<div class="outline-text-3" id="text-配置-pacman">
<p>
添加库 =/etc/pacman.conf=：
</p>

<pre class="example" id="org1f340d9">
[archlinuxcn]
Server = https://repo.archlinuxcn.org/$arch
</pre>

<p>
分布在中国境内的镜像见这里<sup><a id="fnr.9" class="footref" href="#fn.9">9</a></sup>。
</p>

<p>
导入 PGP 公匙（为了验证 archlinuxcn 库）:
</p>

<pre class="example" id="org7990acc">
sudo pacman -Syy &amp;&amp; sudo pacman -S archlinuxcn-keyring
</pre>
</div>
</div>

<div id="outline-container-pacman-命令" class="outline-3">
<h3 id="pacman-命令">pacman 命令</h3>
<div class="outline-text-3" id="text-pacman-命令">
<pre class="example" id="org5c7b854">
## 常用
pacman -Qe # List all explicitly installed packages
pacman -Qet # list all packages explicitly installed and not required as dependencies
pacman -Qent # List all explicitly installed native packages (i.e. present in the sync database) that are not direct or optional dependencies
pacman -Qn # List all native packages (installed from the sync database(s))
pacman -Qm # List all foreign packages (typically manually downloaded and installed or packages removed from the repositories)

sudo pacman -Qtdq | sudo pacman -Rns - # recursively removing orphans and their configuration files

sudo pacman -Qii | awk '/^MODIFIED/ {print $2}' # print modified files under /etc

pacman -Qs regex # List packages by regex

pacman -Qg group_name # List installed packages under this group
pacman -Sg group # List all packages in the package group named `group`, etc, base-devel, gnome
pacman -Qq | grep -Ee '-(bzr|cvs|darcs|git|hg|svn)$' # list all development/unstable packages
pacman -Syu # Update package list and upgrade all packages afterwards
pacman -Syu git # Update package list, upgrade all packages, and then install git if it wasn’t already installed

pacman -S package_name1 package_name2 # Installing specific packages
pacman -S $(pacman -Ssq package_regex) # Install a list of packages with regex
pacman -S extra/package_name # Install specific repositories' package
pacman -S plasma-{desktop,mediacenter,nm}
pacman -S plasma-{workspace{,-wallpapers},pa}

pacman -S gnome # Install through group of packages
Enter a selection (default=all): 1-10 15 # which will select packages 1 through 10 and 15 for installation
Enter a selection (default=all): ^5-8 ^2 # which will select all packages except 5 through 8 and 2 for installation

pacman -R package_name # remove a single package, leaving all of its dependencies installed
pacman -Rs package_name # remove a single package and its dependencies which are not required by any other installed package

pacman -Qtd # check for packages that were installed as a dependency but now, no other packages depend on them

pacman -Ss string1 string2 ... # search for packages in the database
pacman -Qs string1 string2 ... # search for already installed packages
pacman -F string1 string2 ... # search for package file names in remote packages
pacman -Fy string1 string2 ... # first flush local cache, then search for package file names in remote packages

pacman -Si package_name # display extensive information about a given package
pacman -Qi package_name # display extensive information about locally installed packages
pacman -Qii package_name # also display the list of backup files and their modification states

pacman -Ql package_name # retrieve a list of the files installed by a package
pacman -Fl package_name # retrieve a list of the files installed by a remote package



## Rarely use
pacman -Qk package_name # verify the presence of the files installed by a package, Passing the k flag twice will perform a more thorough check
pacman -Qo /path/to/file_name # query the database to know which package a file in the file system belongs to
pacman -F /path/to/file_name # query the database to know which remote package a file belongs to
</pre>
</div>
</div>

<div id="outline-container-应该避免执行的-pacman-指令" class="outline-3">
<h3 id="应该避免执行的-pacman-指令">应该避免执行的 pacman 指令</h3>
<div class="outline-text-3" id="text-应该避免执行的-pacman-指令">
<pre class="example" id="orgb2f64bd">
pacman -Sy # never run!!!
pacman -Rdd package # never run!!!
</pre>

<p>
在 Arch
中安装包时应避免没有升级系统就刷新包列表。这样做是为了避免出现依赖问题，比如，如果一个包被从官方仓库中移除，在进行包同步时就会报错。在实践中，不要执行
<code>pacman -Sy package_name=，应该执行 =pacman -Syu package_name</code>
</p>
</div>
</div>

<div id="outline-container-执行-pacman-命令过程中遇到的信息警告错误" class="outline-3">
<h3 id="执行-pacman-命令过程中遇到的信息警告错误">执行 pacman 命令过程中，遇到的信息/警告/错误</h3>
<div class="outline-text-3" id="text-执行-pacman-命令过程中遇到的信息警告错误">
<p>
循环依赖：
</p>

<pre class="example" id="orgf70fca5">
warning: dependency cycle detected
</pre>

<p>
执行 <code>sudo pacman -Syu</code> 时：
</p>

<pre class="example" id="org53b3b97">
WARNING: Possibly missing firmware for module
</pre>

<p>
这是一种警告。
</p>

<p>
参考：
</p>

<ol class="org-ol">
<li><a href="https://wiki.archlinux.org/title/Mkinitcpio#Possibly_missing_firmware_for_module_XXXX">https://wiki.archlinux.org/title/Mkinitcpio#Possibly_missing_firmware_for_module_XXXX</a></li>
<li><a href="https://arcolinuxforum.com/viewtopic.php?t=1174">https://arcolinuxforum.com/viewtopic.php?t=1174</a></li>
</ol>

<p>
gpg: key 786C63F330D7CB92: no user ID for key signature packet of class
10[^0]
</p>

<pre class="example" id="org56e3341">
gpg: key 786C63F330D7CB92: no user ID for key signature packet of class 10
gpg: key 1EB2638FF56C0C53: no user ID for key signature packet of class 10
gpg: next trustdb check due at 2021-10-09
  -&gt; Disabled 3 keys.

## try 1
sudo pacman-key --refresh-keys
sudo pacman -S archlinux-keyring archlinuxcn-keyring
## try 2
sudo rm -R /etc/pacman.d/gnupg/ # No such file or directory
sudo rm -rf /etc/pacman.d/gnupg/
sudo rm -R /root/.gnupg/ 
sudo rm -R /var/cache/pacman/pkg/
sudo gpg --refresh-keys
sudo pacman-key --init
sudo pacman-key --populate archlinux # still display `gpg: key xxx: no user ID for key signature packet of class 10`
sudo pacman-key --refresh-keys
sudo pacman -Syyu
</pre>

<p>
warning: /etc/pacman.d/mirrorlist installed as
/etc/pacman.d/mirrorlist.pacnew
</p>

<p>
/etc/mkinitcpio.d/linux.preset: 'default' and
/etc/mkinitcpio.d/linux.preset: 'fallback'
</p>

<p>
参考：
</p>

<ol class="org-ol">
<li><a href="https://wiki.archlinux.org/title/Arch_User_Repository#Installing_and_upgrading_packages">https://wiki.archlinux.org/title/Arch_User_Repository#Installing_and_upgrading_packages</a></li>
<li><a href="https://wiki.archlinux.org/title/Frequently_asked_questions#Is_it_possible_that_there_is_a_major_kernel_update_in_the_repository,_and_that_some_of_the_driver_packages_have_not_been_updated">https://wiki.archlinux.org/title/Frequently_asked_questions#Is_it_possible_that_there_is_a_major_kernel_update_in_the_repository,_and_that_some_of_the_driver_packages_have_not_been_updated</a>?</li>
<li><a href="https://wiki.archlinux.org/title/Pacman/Tips_and_tricks">https://wiki.archlinux.org/title/Pacman/Tips_and_tricks</a></li>
<li><a href="https://wiki.archlinux.org/title/Pacman">https://wiki.archlinux.org/title/Pacman</a></li>
<li><a href="https://wiki.archlinux.org/title/System_maintenance#Avoid_certain_pacman_commands">https://wiki.archlinux.org/title/System_maintenance#Avoid_certain_pacman_commands</a></li>
<li><a href="https://wiki.archlinux.org/title/Pacman/Rosetta">https://wiki.archlinux.org/title/Pacman/Rosetta</a></li>
<li><a href="https://wiki.archlinux.org/title/Mkinitcpio">https://wiki.archlinux.org/title/Mkinitcpio</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-yay" class="outline-2">
<h2 id="yay">yay</h2>
<div class="outline-text-2" id="text-yay">
<p>
Yet Another Yogurt: 又一个从 Arch User Repository 下载包的工具。
</p>
</div>

<div id="outline-container-安装-yay" class="outline-3">
<h3 id="安装-yay">安装 yay</h3>
<div class="outline-text-3" id="text-安装-yay">
<pre class="example" id="org8c067b1">
sudo pacman -S yay
# pacman -S --needed git base-devel
# git clone https://aur.archlinux.org/yay.git
