org/blog/2021/arch-software-installation-and-usage.org
*** 使用 yay
    :PROPERTIES:
    :CUSTOM_ID: 使用-yay
    :END:
#+begin_example
  # Interactively search and install packages from the repos and AUR:
  yay package_name|search_term
  # Synchronize and update all packages from the repos and AUR:
  yay
  #Synchronize and update only AUR packages:
  yay -Sua
  # Install a new package from the repos and AUR:
  yay -S package_name
  # Remove an installed package and both its dependencies and configuration files:
  yay -Rns package_name
  # Search the package database for a keyword from the repos and AUR:
  yay -Ss keyword
  # Remove orphaned packages (installed as dependencies but not required by any package):
  yay -Yc
  # Show statistics for installed packages and system health:
  yay -Ps
#+end_example

*** yay 问题
    :PROPERTIES:
    :CUSTOM_ID: yay-问题
    :END:

1. 安装时总是出现
   ===WARNING: Using existing $srcdir/ tree=，这个可以忽视，只是说明安装过程。
2. timeout 问题
   [[https://github.com/Jguer/yay/issues/1278#issuecomment-635833427]]
3. =Missing AUR Packages=

参考：

1. [[https://github.com/Jguer/yay]]
2. [[https://github.com/Jguer/yay/issues/1248]]

** Imager(rpi-imager)
   :PROPERTIES:
   :CUSTOM_ID: imagerrpi-imager
   :END:
#+begin_example
  yay -S rpi-imager
#+end_example

对于支持 UEFI 启动的设备，直接复制 iso 镜像中的所有文件到安装介质（如 U
盘）中即可启动。

