blog/2021/arch-software-installation-and-usage.html
# cd yay
# makepkg -si
</pre>
</div>
</div>

<div id="outline-container-使用-yay" class="outline-3">
<h3 id="使用-yay">使用 yay</h3>
<div class="outline-text-3" id="text-使用-yay">
<pre class="example" id="org340c151">
# Interactively search and install packages from the repos and AUR:
yay package_name|search_term
# Synchronize and update all packages from the repos and AUR:
yay
#Synchronize and update only AUR packages:
yay -Sua
# Install a new package from the repos and AUR:
yay -S package_name
# Remove an installed package and both its dependencies and configuration files:
yay -Rns package_name
# Search the package database for a keyword from the repos and AUR:
yay -Ss keyword
# Remove orphaned packages (installed as dependencies but not required by any package):
yay -Yc
# Show statistics for installed packages and system health:
yay -Ps
</pre>
</div>
</div>

<div id="outline-container-yay-问题" class="outline-3">
<h3 id="yay-问题">yay 问题</h3>
<div class="outline-text-3" id="text-yay-问题">
<ol class="org-ol">
<li>安装时总是出现
===WARNING: Using existing $srcdir/ tree=，这个可以忽视，只是说明安装过程。</li>
<li>timeout 问题
<a href="https://github.com/Jguer/yay/issues/1278#issuecomment-635833427">https://github.com/Jguer/yay/issues/1278#issuecomment-635833427</a></li>
<li><code>Missing AUR Packages</code></li>
</ol>

<p>
参考：
</p>

<ol class="org-ol">
<li><a href="https://github.com/Jguer/yay">https://github.com/Jguer/yay</a></li>
<li><a href="https://github.com/Jguer/yay/issues/1248">https://github.com/Jguer/yay/issues/1248</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-imagerrpi-imager" class="outline-2">
<h2 id="imagerrpi-imager">Imager(rpi-imager)</h2>
<div class="outline-text-2" id="text-imagerrpi-imager">
<pre class="example" id="org9eb6622">
yay -S rpi-imager
</pre>

<p>
对于支持 UEFI 启动的设备，直接复制 iso 镜像中的所有文件到安装介质（如 U
盘）中即可启动。
</p>
</div>
</div>
