org/blog/2021/arch-software-installation-and-usage.org
** 其他软件

参考：

1. [[https://io-oi.me/tech/hello-arch-linux/]]

| 名字                                              | 说明                                                                                                                                                                                     |
|---------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| chromium                                          | 开源浏览器（基于 Blink 渲染引擎）                                                                                                                                                        |
| google-chrome                                     | 浏览器                                                                                                                                                                                   |
| firefox                                           | 浏览器                                                                                                                                                                                   |
| firefox-esr                                       | Firefox(Extended Support Release)浏览器                                                                                                                                                  |
| firefox-developer-edition                         | 具有开发者定制功能的 Firefox 浏览器                                                                                                                                                      |
| brave-bin(aur)                                    | Web browser that blocks ads and trackers by default                                                                                                                                      |
| lynx                                              | A text browser for the World Wide Web                                                                                                                                                    |
| pulseaudio                                        | A featureful, general-purpose sound server                                                                                                                                               |
| kmix                                              | 修复 Firefox 没有声音                                                                                                                                                                    |
| profile-cleaner                                   | Simple script to vacuum and reindex sqlite databases used by browsers 用于对浏览器使用的 sqlite 数据库进行清理和重新索引的简单脚本                                                       |
| visual-studio-code-bin                            | Visual Studio Code                                                                                                                                                                       |
| netease-cloud-music                               | 网易云音乐                                                                                                                                                                               |
| flameshot                                         | 现代、快捷、轻便的截图工具                                                                                                                                                               |
| proxychains-ng                                    | 终端内科学上网代理工具                                                                                                                                                                   |
| redshift                                          | 显示屏色温调节工具                                                                                                                                                                       |
| vlc                                               | 强大的多媒体播放工具                                                                                                                                                                     |
| telegram-desktop                                  | 客户端开源的加密聊天工具                                                                                                                                                                 |
| gthumb                                            | 图片浏览工具，可简单编辑图片，可清除照片元数据                                                                                                                                           |
| libreoffice-fresh                                 | 必备的办公软件                                                                                                                                                                           |
| inkscape                                          | 强大的矢量图形编辑软件                                                                                                                                                                   |
| youtube-dl                                        | YouTube 视频下载工具                                                                                                                                                                     |
| glances                                           | terminal monitoring tool                                                                                                                                                                 |
| keepass                                           | password manager                                                                                                                                                                         |
| hugo                                              | static site generator                                                                                                                                                                    |
| python-sphinx                                     | a documentation generator                                                                                                                                                                |
| anki                                              | a spaced repetition system                                                                                                                                                               |
| informant                                         | arch news reader and pacman hook                                                                                                                                                         |
| dnsutils                                          | =dig=                                                                                                                                                                                    |
| dnsmasq                                           | 使用国外 DNS 造成国内网站访问慢的解决方法                                                                                                                                                |
| tldr                                              | [[https://github.com/tldr-pages/tldr][tldr-pages/tldr]]                                                                                                                                  |
| virtualbox                                        | Virtual Machine                                                                                                                                                                          |
| qemu                                              | A generic and open source machine emulator and virtualizer                                                                                                                               |
| earlyoom                                          | Early OOM Daemon for Linux                                                                                                                                                               |
| gtk2/3/4                                          | GObject-based multi-platform GUI toolkit                                                                                                                                                 |
| lsb-release                                       | LSB version query program                                                                                                                                                                |
| exa                                               | A modern replacement for ls (List directory contents)                                                                                                                                    |
| filezilla                                         | Fast and reliable FTP FTPS and SFTP client                                                                                                                                               |
| intellij-idea-community-edition                   | IDE                                                                                                                                                                                      |
| mysql                                             | Database                                                                                                                                                                                 |
| sagemath                                          | Open Source Mathematics Software free alternative to Magma Maple Mathematica and Matlab Matlab dkms Dynamic Kernel Modules System                                                        |
| maven                                             | Java project management and project comprehension tool                                                                                                                                   |
| graphviz                                          | Graph visualization software                                                                                                                                                             |
| cmdpxl                                            | a totally practical command-line image editor 一个在命令行里画画的程序                                                                                                                   |
| octave(GUI)                                       | A high-level language, primarily intended for numerical computations.                                                                                                                    |
| asciiquarium                                      | An aquarium/sea animation in ASCII art                                                                                                                                                   |
| lx-music-desktop-bin                              | A music software based on Electron + Vue. 一个基于 Electron + Vue 开发的音乐软件                                                                                                         |
| feeluown                                          | FeelUOwn Music Player(feeluown-netease feeluown-qqmusic feeluown-local)                                                                                                                  |
| nuclear-player-bin                                | A free, multiplatform music player app that streams from multiple sources.                                                                                                               |
| beets                                             | Flexible music library manager and tagger                                                                                                                                                |
| mps-youtube                                       | Terminal based YouTube jukebox with playlist management                                                                                                                                  |
| mopidy                                            | An extensible music server written in Python                                                                                                                                             |
| postman-bin                                       | Build, test, and document your APIs faster                                                                                                                                               |
| mongodb-bin                | A high-performance, open source, schema-free document-oriented database                                                                                                                  |
| nginx                                             | Lightweight HTTP server and IMAP/POP3 proxy server                                                                                                                                       |
| zellij(aur)                                       | A terminal multiplexer.                                                                                                                                                                  |
| liferea                                           | A desktop news aggregator for online news feeds and weblogs                                                                                                                              |
| arch-wiki-man(aur)                                | The Arch Wiki as linux man pages                                                                                                                                                         |
| xterm                                             | X Terminal Emulator                                                                                                                                                                      |
| konsole                                           | KDE terminal emulator                                                                                                                                                                    |
| foliate                                           | ebook reader(EPUB, Mobipocket, Kindle, FictionBook, and Comicbook formats.)                                                                                                              |
| mupdf                                             | Lightweight PDF and XPS viewer                                                                                                                                                           |
| okular                                            | Document Viewer(pdf, mobi, equb)                                                                                                                                                         |
| freemind                                          | A Java mindmapping tool                                                                                                                                                                  |
| wireshark-qt                                      | Network traffic and protocol analyzer/sniffer - Qt GUI                                                                                                                                   |
| newsboat                                          | An RSS/Atom feed reader for text terminals                                                                                                                                               |
| [[http://strlen.com/treesheets/][treesheets-bin]] | TreeSheets free form data organizer [[https://hintsnet.com/pimgeek/2019/07/10/if-given-an-infinite-zoomable-paper-what-would-you-write/][给你一张无限大可缩放的白纸, 你会在上面写什么?]] |
| python-pipenv                                     | Sacred Marriage of Pipfile, Pip, & Virtualenv.                                                                                                                                           |
| safeeyes(aur) | Protect your eyes from eye strain using this simple and beautiful, yet extensible break reminder |
| bat | A cat(1) clone with wings |
| htop | Interactive process viewer |
| prettyping | A ping wrapper making the output prettier, more colorful, more compact, and easier to read |

