blog/2021/arch-software-installation-and-usage.html

<div id="outline-container-org8f8edee" class="outline-2">
<h2 id="org8f8edee">其他软件</h2>
<div class="outline-text-2" id="text-org8f8edee">
<p>
参考：
</p>

<ol class="org-ol">
<li><a href="https://io-oi.me/tech/hello-arch-linux/">https://io-oi.me/tech/hello-arch-linux/</a></li>
</ol>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名字</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">chromium</td>
<td class="org-left">开源浏览器（基于 Blink 渲染引擎）</td>
</tr>

<tr>
<td class="org-left">google-chrome</td>
<td class="org-left">浏览器</td>
</tr>

<tr>
<td class="org-left">firefox</td>
<td class="org-left">浏览器</td>
</tr>

<tr>
<td class="org-left">firefox-esr</td>
<td class="org-left">Firefox(Extended Support Release)浏览器</td>
</tr>

<tr>
<td class="org-left">firefox-developer-edition</td>
<td class="org-left">具有开发者定制功能的 Firefox 浏览器</td>
</tr>

<tr>
<td class="org-left">brave-bin(aur)</td>
<td class="org-left">Web browser that blocks ads and trackers by default</td>
</tr>

<tr>
<td class="org-left">lynx</td>
<td class="org-left">A text browser for the World Wide Web</td>
</tr>

<tr>
<td class="org-left">pulseaudio</td>
<td class="org-left">A featureful, general-purpose sound server</td>
</tr>

<tr>
<td class="org-left">kmix</td>
<td class="org-left">修复 Firefox 没有声音</td>
</tr>

<tr>
<td class="org-left">profile-cleaner</td>
<td class="org-left">Simple script to vacuum and reindex sqlite databases used by browsers 用于对浏览器使用的 sqlite 数据库进行清理和重新索引的简单脚本</td>
</tr>

<tr>
<td class="org-left">visual-studio-code-bin</td>
<td class="org-left">Visual Studio Code</td>
</tr>

<tr>
<td class="org-left">netease-cloud-music</td>
<td class="org-left">网易云音乐</td>
</tr>

<tr>
<td class="org-left">flameshot</td>
<td class="org-left">现代、快捷、轻便的截图工具</td>
</tr>

<tr>
<td class="org-left">proxychains-ng</td>
<td class="org-left">终端内科学上网代理工具</td>
</tr>

<tr>
<td class="org-left">redshift</td>
<td class="org-left">显示屏色温调节工具</td>
</tr>

<tr>
<td class="org-left">vlc</td>
<td class="org-left">强大的多媒体播放工具</td>
</tr>

<tr>
<td class="org-left">telegram-desktop</td>
<td class="org-left">客户端开源的加密聊天工具</td>
</tr>

<tr>
<td class="org-left">gthumb</td>
<td class="org-left">图片浏览工具，可简单编辑图片，可清除照片元数据</td>
</tr>

<tr>
<td class="org-left">libreoffice-fresh</td>
<td class="org-left">必备的办公软件</td>
</tr>

<tr>
<td class="org-left">inkscape</td>
<td class="org-left">强大的矢量图形编辑软件</td>
</tr>

<tr>
<td class="org-left">youtube-dl</td>
<td class="org-left">YouTube 视频下载工具</td>
</tr>

<tr>
<td class="org-left">glances</td>
<td class="org-left">terminal monitoring tool</td>
</tr>

<tr>
<td class="org-left">keepass</td>
<td class="org-left">password manager</td>
</tr>

<tr>
<td class="org-left">hugo</td>
<td class="org-left">static site generator</td>
</tr>

<tr>
<td class="org-left">python-sphinx</td>
<td class="org-left">a documentation generator</td>
</tr>

<tr>
<td class="org-left">anki</td>
<td class="org-left">a spaced repetition system</td>
</tr>

<tr>
<td class="org-left">informant</td>
<td class="org-left">arch news reader and pacman hook</td>
</tr>

<tr>
<td class="org-left">dnsutils</td>
<td class="org-left"><code>dig</code></td>
</tr>

<tr>
<td class="org-left">dnsmasq</td>
<td class="org-left">使用国外 DNS 造成国内网站访问慢的解决方法</td>
</tr>

<tr>
<td class="org-left">tldr</td>
<td class="org-left"><a href="https://github.com/tldr-pages/tldr">tldr-pages/tldr</a></td>
</tr>

<tr>
<td class="org-left">virtualbox</td>
<td class="org-left">Virtual Machine</td>
</tr>

<tr>
<td class="org-left">qemu</td>
<td class="org-left">A generic and open source machine emulator and virtualizer</td>
</tr>

<tr>
<td class="org-left">earlyoom</td>
<td class="org-left">Early OOM Daemon for Linux</td>
</tr>

<tr>
<td class="org-left">gtk2/3/4</td>
<td class="org-left">GObject-based multi-platform GUI toolkit</td>
</tr>

<tr>
<td class="org-left">lsb-release</td>
<td class="org-left">LSB version query program</td>
</tr>

<tr>
<td class="org-left">exa</td>
<td class="org-left">A modern replacement for ls (List directory contents)</td>
</tr>

<tr>
<td class="org-left">filezilla</td>
<td class="org-left">Fast and reliable FTP FTPS and SFTP client</td>
</tr>

<tr>
<td class="org-left">intellij-idea-community-edition</td>
<td class="org-left">IDE</td>
</tr>

<tr>
<td class="org-left">mysql</td>
<td class="org-left">Database</td>
</tr>

<tr>
<td class="org-left">sagemath</td>
<td class="org-left">Open Source Mathematics Software free alternative to Magma Maple Mathematica and Matlab Matlab dkms Dynamic Kernel Modules System</td>
</tr>

<tr>
<td class="org-left">maven</td>
<td class="org-left">Java project management and project comprehension tool</td>
</tr>

<tr>
<td class="org-left">graphviz</td>
<td class="org-left">Graph visualization software</td>
</tr>

<tr>
<td class="org-left">cmdpxl</td>
<td class="org-left">a totally practical command-line image editor 一个在命令行里画画的程序</td>
</tr>

<tr>
<td class="org-left">octave(GUI)</td>
<td class="org-left">A high-level language, primarily intended for numerical computations.</td>
</tr>

<tr>
<td class="org-left">asciiquarium</td>
<td class="org-left">An aquarium/sea animation in ASCII art</td>
</tr>

<tr>
<td class="org-left">lx-music-desktop-bin</td>
<td class="org-left">A music software based on Electron + Vue. 一个基于 Electron + Vue 开发的音乐软件</td>
</tr>

<tr>
<td class="org-left">feeluown</td>
<td class="org-left">FeelUOwn Music Player(feeluown-netease feeluown-qqmusic feeluown-local)</td>
</tr>

<tr>
<td class="org-left">nuclear-player-bin</td>
<td class="org-left">A free, multiplatform music player app that streams from multiple sources.</td>
</tr>

<tr>
<td class="org-left">beets</td>
<td class="org-left">Flexible music library manager and tagger</td>
</tr>

<tr>
<td class="org-left">mps-youtube</td>
<td class="org-left">Terminal based YouTube jukebox with playlist management</td>
</tr>

<tr>
<td class="org-left">mopidy</td>
<td class="org-left">An extensible music server written in Python</td>
</tr>

<tr>
<td class="org-left">postman-bin</td>
<td class="org-left">Build, test, and document your APIs faster</td>
</tr>

<tr>
<td class="org-left">mongodb-bin</td>
<td class="org-left">A high-performance, open source, schema-free document-oriented database</td>
</tr>

<tr>
<td class="org-left">nginx</td>
<td class="org-left">Lightweight HTTP server and IMAP/POP3 proxy server</td>
</tr>

<tr>
<td class="org-left">zellij(aur)</td>
<td class="org-left">A terminal multiplexer.</td>
</tr>

<tr>
<td class="org-left">liferea</td>
<td class="org-left">A desktop news aggregator for online news feeds and weblogs</td>
</tr>

<tr>
<td class="org-left">arch-wiki-man(aur)</td>
<td class="org-left">The Arch Wiki as linux man pages</td>
</tr>

<tr>
<td class="org-left">xterm</td>
<td class="org-left">X Terminal Emulator</td>
</tr>

<tr>
<td class="org-left">konsole</td>
<td class="org-left">KDE terminal emulator</td>
</tr>

<tr>
<td class="org-left">foliate</td>
<td class="org-left">ebook reader(EPUB, Mobipocket, Kindle, FictionBook, and Comicbook formats.)</td>
</tr>

<tr>
<td class="org-left">mupdf</td>
<td class="org-left">Lightweight PDF and XPS viewer</td>
</tr>

<tr>
<td class="org-left">okular</td>
<td class="org-left">Document Viewer(pdf, mobi, equb)</td>
</tr>

<tr>
<td class="org-left">freemind</td>
<td class="org-left">A Java mindmapping tool</td>
</tr>

<tr>
<td class="org-left">wireshark-qt</td>
<td class="org-left">Network traffic and protocol analyzer/sniffer - Qt GUI</td>
</tr>

<tr>
<td class="org-left">newsboat</td>
<td class="org-left">An RSS/Atom feed reader for text terminals</td>
</tr>

<tr>
<td class="org-left"><a href="http://strlen.com/treesheets/">treesheets-bin</a></td>
<td class="org-left">TreeSheets free form data organizer <a href="https://hintsnet.com/pimgeek/2019/07/10/if-given-an-infinite-zoomable-paper-what-would-you-write/">给你一张无限大可缩放的白纸, 你会在上面写什么?</a></td>
</tr>

<tr>
<td class="org-left">python-pipenv</td>
<td class="org-left">Sacred Marriage of Pipfile, Pip, &amp; Virtualenv.</td>
</tr>

<tr>
<td class="org-left">safeeyes(aur)</td>
<td class="org-left">Protect your eyes from eye strain using this simple and beautiful, yet extensible break reminder</td>
</tr>

<tr>
<td class="org-left">bat</td>
<td class="org-left">A cat(1) clone with wings</td>
</tr>

<tr>
<td class="org-left">htop</td>
<td class="org-left">Interactive process viewer</td>
</tr>

<tr>
<td class="org-left">prettyping</td>
<td class="org-left">A ping wrapper making the output prettier, more colorful, more compact, and easier to read</td>
</tr>
</tbody>
</table>
</div>
