org/blog/2021/arch-software-installation-and-usage.org
*** MongoDB

#+BEGIN_SRC sh
yay -S mongodb-bin mongodb-tools-bin mongosh-bin
#+END_SRC

*** Fly.io
    :PROPERTIES:
    :CUSTOM_ID: fly.io
    :END:
#+begin_example
  curl -L https://fly.io/install.sh | sh
  flyctl auth login
  flyctl info
  flyctl open
#+end_example

*** ventoy
    :PROPERTIES:
    :CUSTOM_ID: ventoy
    :END:
Output:

#+begin_example
  NOTE: You can create persistence images for ventoy with the "ventoy-persistent" command,
        and losslessly expand persistence ".dat" files using "ventoy-extend-persistent",
        which are shortcuts to "/opt/ventoy/CreatePersistentImg.sh" and
        "/opt/ventoy/ExtendPersistentImg.sh", respectively.
        (See https://www.ventoy.net/en/plugin_persistence.html for documentation.)
#+end_example

*** cmdpxl
    :PROPERTIES:
    :CUSTOM_ID: cmdpxl
    :END:
#+begin_example
  pip install cmdpxl
#+end_example

*** maven
    :PROPERTIES:
    :CUSTOM_ID: maven
    :END:
Apache Maven. Tool for building and managing Java-based projects. More
information: [[https://maven.apache.org]].

#+begin_example
  -   Compile a project:
      :   mvn compile

  -   Compile and package the compiled code in its distributable format, such as a `jar`:
      :   mvn package

  -   Compile and package, skipping unit tests:
      :   mvn package -Dmaven.test.skip=true

  -   Install the built package in local maven repository. (This will invoke the compile and package commands too):
      :   mvn install

  -   Delete build artifacts from the target directory:
      :   mvn clean

  -   Do a clean and then invoke the package phase:
      :   mvn clean package

  -   Clean and then package the code with a given build profile:
      :   mvn clean -Pprofile package

  -   Run a class with a main method:
      :   mvn exec:java -Dexec.mainClass="com.example.Main"
          -Dexec.args="arg1 arg2"
#+end_example

*** Sagemath
    :PROPERTIES:
    :CUSTOM_ID: sagemath
    :END:
#+begin_example
  sudo pacman -S sagemath
#+end_example

Output:

#+begin_example
  resolving dependencies...
  looking for conflicting packages...
  warning: dependency cycle detected:
  warning: python-ipykernel will be installed before its python-jupyter_client dependency
  warning: dependency cycle detected:
  warning: jupyter will be installed before its python-ipywidgets dependency
#+end_example

*** Tomcat8
    :PROPERTIES:
    :CUSTOM_ID: tomcat8
    :END:
#+begin_example
  sudo pacman -S tomcat8
#+end_example

Output:

#+begin_example
  extra/eclipse-ecj          4.6.3-2        1.65 MiB       1.53 MiB
  extra/java-commons-daemon  1.2.4-1        0.02 MiB       0.02 MiB
  extra/java-jsvc            1.2.4-1        0.06 MiB       0.02 MiB
  extra/tomcat8              8.5.70-1       9.83 MiB       5.54 MiB

  Optional dependencies for tomcat8
  tomcat-native: to allow optimal performance in production environments
  \:\: Running post-transaction hooks...
  (1/4) Creating system user accounts...
  Creating group tomcat8 with gid 57.
  Creating user tomcat8 (Tomcat 8 user) with uid 57 and gid 57.
#+end_example

*** MySQL
    :PROPERTIES:
    :CUSTOM_ID: mysql
    :END:
#+begin_example
  sudo pacman -S mysql
#+end_example

Output:

#+begin_example
  archlinuxcn/libmysqlclient  8.0.24-1       6.89 MiB       1.31 MiB
  archlinuxcn/mysql-clients   8.0.24-1      52.30 MiB       2.12 MiB
  archlinuxcn/mysql           8.0.24-1     172.41 MiB      19.10 MiB

  :: You need to initialize the MySQL data directory prior to starting
  the service. This can be done with mysqld --initialize command, e.g.:
  mysqld --initialize --user=mysql --basedir=/usr --datadir=/var/lib/mysql
  :: Additionally you should secure your MySQL installation using
  mysql_secure_installation command after starting the mysqld service
  Optional dependencies for mysql
  perl-dbd-mysql: for mysqlhotcopy, mysql_convert_table_format, mysql_setpermission, mysqldumpslow
  :: Running post-transaction hooks...
  (1/4) Creating system user accounts...
  Creating group mysqlrouter with gid 88.
  Creating user mysqlrouter (MySQL) with uid 88 and gid 88.
  Creating group mysql with gid 89.
  Creating user mysql (MySQL) with uid 89 and gid 89.
  (2/4) Reloading system manager configuration...
  (3/4) Creating temporary files...
  (4/4) Arming ConditionNeedsUpdate...
#+end_example

删除 mysql，使用 percona-server 管理。

#+begin_example
  sudo pacman -S percona-server
#+end_example

Output:

#+begin_example
  extra/numactl             2.0.14-1       0.22 MiB       0.08 MiB
  community/percona-server  8.0.25_15-2  167.91 MiB      25.30 MiB
#+end_example

*** IDEA
    :PROPERTIES:
    :CUSTOM_ID: idea
    :END:
#+begin_example
  sudo pacman -S intellij-idea-community-edition/intellij-idea-ultimate-edition
#+end_example

Output:

#+begin_example
  # select jdk11-openjdk
  extra/java-environment-common              3-3              0.00 MiB       0.00 MiB
  extra/java-runtime-common                  3-3              0.01 MiB       0.00 MiB
  extra/jdk11-openjdk                        11.0.12.u7-1    87.48 MiB      76.32 MiB
  extra/jre11-openjdk                        11.0.12.u7-1     0.52 MiB       0.19 MiB
  extra/jre11-openjdk-headless               11.0.12.u7-1   157.54 MiB      35.20 MiB
  extra/libnet                               1:1.1.6-1        0.30 MiB       0.09 MiB
  community/intellij-idea-community-edition  4:2021.1.3-1  1245.40 MiB     436.08 MiB
  For the complete set of Java binaries to be available in your PATH,
  you need to re-login or source /etc/profile.d/jre.sh
  Please note that this package does not support forcing JAVA_HOME as former package java-common did

  when you use a non-reparenting window manager,
  set _JAVA_AWT_WM_NONREPARENTING=1 in /etc/profile.d/jre.sh
#+end_example

*** Sphinx
    :PROPERTIES:
    :CUSTOM_ID: sphinx
    :END:
Sphinx is a documentation generator or a tool that translates a set of
plain text source files into various output formats, automatically
producing cross-references, indices, etc.

#+begin_example
  pip install sphinx-autobuild rstcheck # for VS Code extension: reStructuredText
  pip install sphinx-rtd-theme # sphinx-rtd-theme theme
  pip install sphinx-copybutton
  pip install m2r2 # converts a markdown file including reStructuredText (rst) markups to a valid rst format
  sudo pacman -S python-sphinx-issues python-sphinx-furo
#+end_example

*** exa
    :PROPERTIES:
    :CUSTOM_ID: exa
    :END:
A modern replacement for =ls= (List directory contents)
[[https://the.exa.website]]

#+begin_example
  exa
  exa --oneline # List files one per line
  exa --all # List all files, including hidden files
  exa --long --all # Long format list (permissions, ownership, size and modification date) of all files
  exa --reverse --sort=size # List files with the largest at the top
  exa --long --tree --level=3 # Display a tree of files, three levels deep
  exa --long --sort=modified # List files sorted by modification date (oldest first)
  exa --long --header --icons --git # List files with their headers, icons, and Git statuses
  exa --git-ignore # Don't list files mentioned in `.gitignore`
#+end_example

*** informant[fn:10]
    :PROPERTIES:
    :CUSTOM_ID: informant10
    :END:
一个 Arch Linux 新闻阅读器和 pacman
hook。可以帮你在更新包时检查是否还有没有阅读的 Arch Linux 新闻。

