blog/2021/arch-software-installation-and-usage.html

<div id="outline-container-org3e4eb72" class="outline-3">
<h3 id="org3e4eb72">MongoDB</h3>
<div class="outline-text-3" id="text-org3e4eb72">
<div class="org-src-container">
<pre class="src src-sh">yay -S mongodb-bin mongodb-tools-bin mongosh-bin
</pre>
</div>
</div>
</div>

<div id="outline-container-fly.io" class="outline-3">
<h3 id="fly.io">Fly.io</h3>
<div class="outline-text-3" id="text-fly.io">
<pre class="example" id="org3913f2f">
curl -L https://fly.io/install.sh | sh
flyctl auth login
flyctl info
flyctl open
</pre>
</div>
</div>

<div id="outline-container-ventoy" class="outline-3">
<h3 id="ventoy">ventoy</h3>
<div class="outline-text-3" id="text-ventoy">
<p>
Output:
</p>

<pre class="example" id="orgd23ea63">
NOTE: You can create persistence images for ventoy with the "ventoy-persistent" command,
      and losslessly expand persistence ".dat" files using "ventoy-extend-persistent",
      which are shortcuts to "/opt/ventoy/CreatePersistentImg.sh" and
      "/opt/ventoy/ExtendPersistentImg.sh", respectively.
      (See https://www.ventoy.net/en/plugin_persistence.html for documentation.)
</pre>
</div>
</div>

<div id="outline-container-cmdpxl" class="outline-3">
<h3 id="cmdpxl">cmdpxl</h3>
<div class="outline-text-3" id="text-cmdpxl">
<pre class="example" id="orgf5ab3d2">
pip install cmdpxl
</pre>
</div>
</div>

<div id="outline-container-maven" class="outline-3">
<h3 id="maven">maven</h3>
<div class="outline-text-3" id="text-maven">
<p>
Apache Maven. Tool for building and managing Java-based projects. More
information: <a href="https://maven.apache.org">https://maven.apache.org</a>.
</p>

<pre class="example" id="org46229a4">
-   Compile a project:
    :   mvn compile

-   Compile and package the compiled code in its distributable format, such as a `jar`:
    :   mvn package

-   Compile and package, skipping unit tests:
    :   mvn package -Dmaven.test.skip=true

-   Install the built package in local maven repository. (This will invoke the compile and package commands too):
    :   mvn install

-   Delete build artifacts from the target directory:
    :   mvn clean

-   Do a clean and then invoke the package phase:
    :   mvn clean package

-   Clean and then package the code with a given build profile:
    :   mvn clean -Pprofile package

-   Run a class with a main method:
    :   mvn exec:java -Dexec.mainClass="com.example.Main"
        -Dexec.args="arg1 arg2"
</pre>
</div>
</div>

<div id="outline-container-sagemath" class="outline-3">
<h3 id="sagemath">Sagemath</h3>
<div class="outline-text-3" id="text-sagemath">
<pre class="example" id="org1f654c8">
sudo pacman -S sagemath
</pre>

<p>
Output:
</p>

<pre class="example" id="org3181e74">
resolving dependencies...
looking for conflicting packages...
warning: dependency cycle detected:
warning: python-ipykernel will be installed before its python-jupyter_client dependency
warning: dependency cycle detected:
warning: jupyter will be installed before its python-ipywidgets dependency
</pre>
</div>
</div>

<div id="outline-container-tomcat8" class="outline-3">
<h3 id="tomcat8">Tomcat8</h3>
<div class="outline-text-3" id="text-tomcat8">
<pre class="example" id="orgd3fd3c3">
sudo pacman -S tomcat8
</pre>

<p>
Output:
</p>

<pre class="example" id="org55c87e7">
extra/eclipse-ecj          4.6.3-2        1.65 MiB       1.53 MiB
extra/java-commons-daemon  1.2.4-1        0.02 MiB       0.02 MiB
extra/java-jsvc            1.2.4-1        0.06 MiB       0.02 MiB
extra/tomcat8              8.5.70-1       9.83 MiB       5.54 MiB

Optional dependencies for tomcat8
tomcat-native: to allow optimal performance in production environments
\:\: Running post-transaction hooks...
(1/4) Creating system user accounts...
Creating group tomcat8 with gid 57.
Creating user tomcat8 (Tomcat 8 user) with uid 57 and gid 57.
</pre>
</div>
</div>

<div id="outline-container-mysql" class="outline-3">
<h3 id="mysql">MySQL</h3>
<div class="outline-text-3" id="text-mysql">
<pre class="example" id="org6c8ca0e">
sudo pacman -S mysql
</pre>

<p>
Output:
</p>

<pre class="example" id="orgc697597">
archlinuxcn/libmysqlclient  8.0.24-1       6.89 MiB       1.31 MiB
archlinuxcn/mysql-clients   8.0.24-1      52.30 MiB       2.12 MiB
archlinuxcn/mysql           8.0.24-1     172.41 MiB      19.10 MiB

:: You need to initialize the MySQL data directory prior to starting
the service. This can be done with mysqld --initialize command, e.g.:
mysqld --initialize --user=mysql --basedir=/usr --datadir=/var/lib/mysql
:: Additionally you should secure your MySQL installation using
mysql_secure_installation command after starting the mysqld service
Optional dependencies for mysql
perl-dbd-mysql: for mysqlhotcopy, mysql_convert_table_format, mysql_setpermission, mysqldumpslow
:: Running post-transaction hooks...
(1/4) Creating system user accounts...
Creating group mysqlrouter with gid 88.
Creating user mysqlrouter (MySQL) with uid 88 and gid 88.
Creating group mysql with gid 89.
Creating user mysql (MySQL) with uid 89 and gid 89.
(2/4) Reloading system manager configuration...
(3/4) Creating temporary files...
(4/4) Arming ConditionNeedsUpdate...
</pre>

<p>
删除 mysql，使用 percona-server 管理。
</p>

<pre class="example" id="orgc4ad10d">
sudo pacman -S percona-server
</pre>

<p>
Output:
</p>

<pre class="example" id="orgf5b2585">
extra/numactl             2.0.14-1       0.22 MiB       0.08 MiB
community/percona-server  8.0.25_15-2  167.91 MiB      25.30 MiB
</pre>
</div>
</div>

<div id="outline-container-idea" class="outline-3">
<h3 id="idea">IDEA</h3>
<div class="outline-text-3" id="text-idea">
<pre class="example" id="orgd229e00">
sudo pacman -S intellij-idea-community-edition/intellij-idea-ultimate-edition
</pre>

<p>
Output:
</p>

<pre class="example" id="org88210bd">
# select jdk11-openjdk
extra/java-environment-common              3-3              0.00 MiB       0.00 MiB
extra/java-runtime-common                  3-3              0.01 MiB       0.00 MiB
extra/jdk11-openjdk                        11.0.12.u7-1    87.48 MiB      76.32 MiB
extra/jre11-openjdk                        11.0.12.u7-1     0.52 MiB       0.19 MiB
extra/jre11-openjdk-headless               11.0.12.u7-1   157.54 MiB      35.20 MiB
extra/libnet                               1:1.1.6-1        0.30 MiB       0.09 MiB
community/intellij-idea-community-edition  4:2021.1.3-1  1245.40 MiB     436.08 MiB
For the complete set of Java binaries to be available in your PATH,
you need to re-login or source /etc/profile.d/jre.sh
Please note that this package does not support forcing JAVA_HOME as former package java-common did

when you use a non-reparenting window manager,
set _JAVA_AWT_WM_NONREPARENTING=1 in /etc/profile.d/jre.sh
</pre>
</div>
</div>

<div id="outline-container-sphinx" class="outline-3">
<h3 id="sphinx">Sphinx</h3>
<div class="outline-text-3" id="text-sphinx">
<p>
Sphinx is a documentation generator or a tool that translates a set of
plain text source files into various output formats, automatically
producing cross-references, indices, etc.
</p>

<pre class="example" id="orgd350e5f">
pip install sphinx-autobuild rstcheck # for VS Code extension: reStructuredText
pip install sphinx-rtd-theme # sphinx-rtd-theme theme
pip install sphinx-copybutton
pip install m2r2 # converts a markdown file including reStructuredText (rst) markups to a valid rst format
sudo pacman -S python-sphinx-issues python-sphinx-furo
</pre>
</div>
</div>

<div id="outline-container-exa" class="outline-3">
<h3 id="exa">exa</h3>
<div class="outline-text-3" id="text-exa">
<p>
A modern replacement for <code>ls</code> (List directory contents)
<a href="https://the.exa.website">https://the.exa.website</a>
</p>

<pre class="example" id="org2501702">
exa
exa --oneline # List files one per line
exa --all # List all files, including hidden files
exa --long --all # Long format list (permissions, ownership, size and modification date) of all files
exa --reverse --sort=size # List files with the largest at the top
exa --long --tree --level=3 # Display a tree of files, three levels deep
exa --long --sort=modified # List files sorted by modification date (oldest first)
exa --long --header --icons --git # List files with their headers, icons, and Git statuses
exa --git-ignore # Don't list files mentioned in `.gitignore`
</pre>
</div>
</div>

<div id="outline-container-informant10" class="outline-3">
<h3 id="informant10">informant<sup><a id="fnr.10" class="footref" href="#fn.10">10</a></sup></h3>
<div class="outline-text-3" id="text-informant10">
<p>
一个 Arch Linux 新闻阅读器和 pacman
hook。可以帮你在更新包时检查是否还有没有阅读的 Arch Linux 新闻。
</p>
</div>
</div>
