org/blog/2021/arch-software-installation-and-usage.org
*** Virtualbox[fn:11]
    :PROPERTIES:
    :CUSTOM_ID: virtualbox11
    :END:
Error message:

#+begin_example
  WARNING: The vboxdrv kernel module is not loaded. Either there is no module available for the current kernel (5.13.8-arch1-1) or it failed to load. Please recompile the kernel module and install it by

  sudo /sbin/vboxconfig

  You will not be able to start VMs until this problem is fixed.
#+end_example

exec:

#+begin_example
  sudo modprobe vboxdrv
#+end_example

No message now.

*** earlyoom
    :PROPERTIES:
    :CUSTOM_ID: earlyoom
    :END:
如果是为了避免系统卡死，可以安装并使用 earlyoom[fn:12]。

该软件默认将在空余内存、空余 swap 两者均低于 10%时，结束 oom_score
值最高的进程，避免系统内存耗尽卡死。

#+begin_example
  # after install
  sudo systemctl enable --now earlyoom
#+end_example

*** Vagrant[fn:13]
    :PROPERTIES:
    :CUSTOM_ID: vagrant13
    :END:
#+begin_example
  sudo pacman -S vagrant
  mkdir arch-vagrant &&  cd $_
  vim Vagrantfile
  vagrant up
#+end_example

=Vagrantfile=:

#+begin_example
  Vagrant.configure("2") do |config|
      config.vm.box = "archlinux/archlinux"
  end
#+end_example

After exec =vagrant up=, error message:

#+begin_example
  No usable default provider could be found for your system.

  Vagrant relies on interactions with 3rd party systems, known as

  "providers", to provide Vagrant with resources to run development

  environments. Examples are VirtualBox, VMware, Hyper-V.

  The easiest solution to this message is to install VirtualBox, which

  is available for free on all major platforms.

  If you believe you already have a provider available, make sure it

  is properly installed and configured. You can see more details about

  why a particular provider isn't working by forcing usage with

  `vagrant up --provider=PROVIDER`, which should give you a more specific

  error message for that particular provider.
#+end_example

After exec =sudo modprobe vboxdrv=, no message now.

#+begin_example
  vagrant up
#+end_example

Output:

#+begin_example
  Vagrant is currently configured to create VirtualBox synced folders with
  the `SharedFoldersEnableSymlinksCreate` option enabled. If the Vagrant
  guest is not trusted, you may want to disable this option. For more
  information on this option, please refer to the VirtualBox manual:

      https://www.virtualbox.org/manual/ch04.html#sharedfolders

  This option can be disabled globally with an environment variable:

      VAGRANT_DISABLE_VBOXSYMLINKCREATE=1

  or on a per folder basis within the Vagrantfile:

      config.vm.synced_folder '/host/path', '/guest/path', SharedFoldersEnableSymlinksCreate: false

  NS_ERROR_INVALID_ARG
#+end_example

*** QEMU
    :PROPERTIES:
    :CUSTOM_ID: qemu
    :END:
#+begin_example
  sudo pacman -S qemu
#+end_example

Output:

#+begin_example
  Please add your user to the brlapi group.
  Optional dependencies for brltty
      at-spi2-core: X11/GNOME Apps accessibility [installed]
      atk: ATK bridge for X11/GNOME accessibility [installed]
      espeak-ng: espeak-ng driver
      java-runtime: Java support [installed]
      libxaw: X11 support [installed]
      libxt: X11 support [installed]
      libx11: for xbrlapi [installed]
      libxfixes: for xbrlapi [installed]
      libxtst: for xbrlapi [installed]
      ocaml: OCaml support
      python: Python support [installed]
      speech-dispatcher: speech-dispatcher driver [installed]
  vde config files should be placed in /etc/vde, sample files are provided.
  iptables and dhcpd sample files have been installed to '/usr/share/vde2'.
  Merge those examples, if needed to the according config files.
#+end_example

*** Mutt[fn:14]
    :PROPERTIES:
    :CUSTOM_ID: mutt14
    :END:
终端邮件

*** Flameshot
    :PROPERTIES:
    :CUSTOM_ID: flameshot
    :END:
可以配置下快捷键，使用起来更加快捷。去 Settings >
Keyboard，然后下拉页面到底部，点击 =+= 号，Name 填 =Flameshot=，Command
填 =flameshot gui=，然后点击下 Shortcut 的右方方块，按下 =Alt= +
=Super/Win= + =P= 键

*** Anki[fn:15]
    :PROPERTIES:
    :CUSTOM_ID: anki15
    :END:
#+begin_example
  tar xjf ~/Downloads/anki-2.1.46-linux.tar.bz2
  cd anki-2.1.46-linux
  sudo ./install.sh
#+end_example

*** exercism
    :PROPERTIES:
    :CUSTOM_ID: exercism
    :END:
#+begin_example
  # https://github.com/exercism/cli/releases/ download exercism-linux-64bit.tgz
  tar -xf exercism-linux-64bit.tgz
  # Once you download and extract the archive, make it available in your $PATH
  cd ~/Downloads/exercism-linux-64bit
  mkdir -p ~/bin
  mv exercism ~/bin
  ~/bin/exercism
  exercism configure --token=
#+end_example

*** Scheme Programming Language
    :PROPERTIES:
    :CUSTOM_ID: scheme-programming-language
    :END:
#+begin_example
  guile hello-world.scm
  ;;; note: source file /home/archie/exercism/scheme/hello-world/hello-world.scm
  ;;;       newer than compiled /home/archie/.cache/guile/ccache/2.2-LE-8-3.A/home/archie/exercism/scheme/hello-world/hello-world.scm.go
  ;;; note: auto-compilation is enabled, set GUILE_AUTO_COMPILE=0
  ;;;       or pass the --no-auto-compile argument to disable.
  ;;; compiling /home/archie/exercism/scheme/hello-world/hello-world.scm
  ;;; compiled /home/archie/.cache/guile/ccache/2.2-LE-8-3.A/home/archie/exercism/scheme/hello-world/hello-world.scm.go
  Hello World!

  guile hello-world.scm --no-auto-compile
#+end_example

How to close these info?

=.zshrc=:

#+begin_example
  alias guile="guile --no-auto-compile"
#+end_example

[[https://www.linuxfromscratch.org/blfs/view/svn/general/guile.html][Install
guile]]

*** =nscd= 自启动
    :PROPERTIES:
    :CUSTOM_ID: nscd-自启动
    :END:
#+begin_example
  systemctl enable nscd
#+end_example

nscd is a daemon that provides a cache for the most common name service
requests. The default configuration file, /etc/nscd.conf, determines the
behavior of the cache daemon.

*** redshift
    :PROPERTIES:
    :CUSTOM_ID: redshift
    :END:
纬度，经度 115.622324,33.165395

#+begin_example
  mkdir ~/.config/redshift
  vim ~/.config/redshift/redshift.conf
#+end_example

=~/.config/redshift/redshift.conf=:

#+begin_example
  [redshift]
  location-provider=manual
  temp-day=5500
  temp-night=3700

  [manual]
  lat=33.165395
  lon=115.622324
#+end_example

参考：

1. [[https://wiki.archlinux.org/title/redshift]]
2. [[https://io-oi.me/tech/hello-arch-linux/#redshift]]

*** tldr
    :PROPERTIES:
    :CUSTOM_ID: tldr
    :END:

1. tldr-node-client

#+begin_example
  npm install -g tldr
  cd ~/.nvm/versions/node/v14.18.1/lib/node_modules/tldr
  mkdir -p $ZSH_CUSTOM/plugins/tldr
  cp bin/completion/zsh/_tldr $ZSH_CUSTOM/plugins/tldr/_tldr
#+end_example

在 =~/.zshrc= 的 plugins 中加入 tldr。

2. tldr-python-client

#+begin_example
  sudo pacman -S tldr
#+end_example

在 =~/.zshrc= 中加入以下内容：

#+begin_example
  export TLDR_CACHE_ENABLED=1
  export TLDR_CACHE_MAX_AGE=720
  export TLDR_PAGES_SOURCE_LOCATION="https://raw.githubusercontent.com/tldr-pages/tldr/master/pages"
  export TLDR_DOWNLOAD_CACHE_LOCATION="https://tldr-pages.github.io/assets/tldr.zip"
#+end_example

