blog/2021/arch-software-installation-and-usage.html

<div id="outline-container-virtualbox11" class="outline-3">
<h3 id="virtualbox11">Virtualbox<sup><a id="fnr.11" class="footref" href="#fn.11">11</a></sup></h3>
<div class="outline-text-3" id="text-virtualbox11">
<p>
Error message:
</p>

<pre class="example" id="orgd8ecc16">
WARNING: The vboxdrv kernel module is not loaded. Either there is no module available for the current kernel (5.13.8-arch1-1) or it failed to load. Please recompile the kernel module and install it by

sudo /sbin/vboxconfig

You will not be able to start VMs until this problem is fixed.
</pre>

<p>
exec:
</p>

<pre class="example" id="org18a09f9">
sudo modprobe vboxdrv
</pre>

<p>
No message now.
</p>
</div>
</div>

<div id="outline-container-earlyoom" class="outline-3">
<h3 id="earlyoom">earlyoom</h3>
<div class="outline-text-3" id="text-earlyoom">
<p>
如果是为了避免系统卡死，可以安装并使用 earlyoom<sup><a id="fnr.12" class="footref" href="#fn.12">12</a></sup>。
</p>

<p>
该软件默认将在空余内存、空余 swap 两者均低于 10%时，结束 oom_score
值最高的进程，避免系统内存耗尽卡死。
</p>

<pre class="example" id="org564173f">
# after install
sudo systemctl enable --now earlyoom
</pre>
</div>
</div>

<div id="outline-container-vagrant13" class="outline-3">
<h3 id="vagrant13">Vagrant<sup><a id="fnr.13" class="footref" href="#fn.13">13</a></sup></h3>
<div class="outline-text-3" id="text-vagrant13">
<pre class="example" id="org04fe0b3">
sudo pacman -S vagrant
mkdir arch-vagrant &amp;&amp;  cd $_
vim Vagrantfile
vagrant up
</pre>

<p>
<code>Vagrantfile</code>:
</p>

<pre class="example" id="org53f554d">
Vagrant.configure("2") do |config|
    config.vm.box = "archlinux/archlinux"
end
</pre>

<p>
After exec <code>vagrant up</code>, error message:
</p>

<pre class="example" id="org20f7faf">
No usable default provider could be found for your system.

Vagrant relies on interactions with 3rd party systems, known as

"providers", to provide Vagrant with resources to run development

environments. Examples are VirtualBox, VMware, Hyper-V.

The easiest solution to this message is to install VirtualBox, which

is available for free on all major platforms.

If you believe you already have a provider available, make sure it

is properly installed and configured. You can see more details about

why a particular provider isn't working by forcing usage with

`vagrant up --provider=PROVIDER`, which should give you a more specific

error message for that particular provider.
</pre>

<p>
After exec <code>sudo modprobe vboxdrv</code>, no message now.
</p>

<pre class="example" id="org74310f0">
vagrant up
</pre>

<p>
Output:
</p>

<pre class="example" id="orgf8c1a3d">
Vagrant is currently configured to create VirtualBox synced folders with
the `SharedFoldersEnableSymlinksCreate` option enabled. If the Vagrant
guest is not trusted, you may want to disable this option. For more
information on this option, please refer to the VirtualBox manual:

    https://www.virtualbox.org/manual/ch04.html#sharedfolders

This option can be disabled globally with an environment variable:

    VAGRANT_DISABLE_VBOXSYMLINKCREATE=1

or on a per folder basis within the Vagrantfile:

    config.vm.synced_folder '/host/path', '/guest/path', SharedFoldersEnableSymlinksCreate: false

NS_ERROR_INVALID_ARG
</pre>
</div>
</div>

<div id="outline-container-qemu" class="outline-3">
<h3 id="qemu">QEMU</h3>
<div class="outline-text-3" id="text-qemu">
<pre class="example" id="org799c2c4">
sudo pacman -S qemu
</pre>

<p>
Output:
</p>

<pre class="example" id="orgc279385">
Please add your user to the brlapi group.
Optional dependencies for brltty
    at-spi2-core: X11/GNOME Apps accessibility [installed]
    atk: ATK bridge for X11/GNOME accessibility [installed]
    espeak-ng: espeak-ng driver
    java-runtime: Java support [installed]
    libxaw: X11 support [installed]
    libxt: X11 support [installed]
    libx11: for xbrlapi [installed]
    libxfixes: for xbrlapi [installed]
    libxtst: for xbrlapi [installed]
    ocaml: OCaml support
    python: Python support [installed]
    speech-dispatcher: speech-dispatcher driver [installed]
vde config files should be placed in /etc/vde, sample files are provided.
iptables and dhcpd sample files have been installed to '/usr/share/vde2'.
Merge those examples, if needed to the according config files.
</pre>
</div>
</div>

<div id="outline-container-mutt14" class="outline-3">
<h3 id="mutt14">Mutt<sup><a id="fnr.14" class="footref" href="#fn.14">14</a></sup></h3>
<div class="outline-text-3" id="text-mutt14">
<p>
终端邮件
</p>
</div>
</div>

<div id="outline-container-flameshot" class="outline-3">
<h3 id="flameshot">Flameshot</h3>
<div class="outline-text-3" id="text-flameshot">
<p>
可以配置下快捷键，使用起来更加快捷。去 Settings &gt;
Keyboard，然后下拉页面到底部，点击 <code>+</code> 号，Name 填 <code>Flameshot=，Command
填 =flameshot gui=，然后点击下 Shortcut 的右方方块，按下 =Alt</code> +
<code>Super/Win</code> + <code>P</code> 键
</p>
</div>
</div>

<div id="outline-container-anki15" class="outline-3">
<h3 id="anki15">Anki<sup><a id="fnr.15" class="footref" href="#fn.15">15</a></sup></h3>
<div class="outline-text-3" id="text-anki15">
<pre class="example" id="org973d185">
tar xjf ~/Downloads/anki-2.1.46-linux.tar.bz2
cd anki-2.1.46-linux
sudo ./install.sh
</pre>
</div>
</div>

<div id="outline-container-exercism" class="outline-3">
<h3 id="exercism">exercism</h3>
<div class="outline-text-3" id="text-exercism">
<pre class="example" id="orgdfb2e8e">
# https://github.com/exercism/cli/releases/ download exercism-linux-64bit.tgz
tar -xf exercism-linux-64bit.tgz
# Once you download and extract the archive, make it available in your $PATH
cd ~/Downloads/exercism-linux-64bit
mkdir -p ~/bin
mv exercism ~/bin
~/bin/exercism
exercism configure --token=
</pre>
</div>
</div>

<div id="outline-container-scheme-programming-language" class="outline-3">
<h3 id="scheme-programming-language">Scheme Programming Language</h3>
<div class="outline-text-3" id="text-scheme-programming-language">
<pre class="example" id="orga121e99">
guile hello-world.scm
;;; note: source file /home/archie/exercism/scheme/hello-world/hello-world.scm
;;;       newer than compiled /home/archie/.cache/guile/ccache/2.2-LE-8-3.A/home/archie/exercism/scheme/hello-world/hello-world.scm.go
;;; note: auto-compilation is enabled, set GUILE_AUTO_COMPILE=0
;;;       or pass the --no-auto-compile argument to disable.
;;; compiling /home/archie/exercism/scheme/hello-world/hello-world.scm
;;; compiled /home/archie/.cache/guile/ccache/2.2-LE-8-3.A/home/archie/exercism/scheme/hello-world/hello-world.scm.go
Hello World!

guile hello-world.scm --no-auto-compile
</pre>

<p>
How to close these info?
</p>

<p>
<code>.zshrc</code>:
</p>

<pre class="example" id="org8c96fd8">
alias guile="guile --no-auto-compile"
</pre>

<p>
<a href="https://www.linuxfromscratch.org/blfs/view/svn/general/guile.html">Install
guile</a>
</p>
</div>
</div>

<div id="outline-container-nscd-自启动" class="outline-3">
<h3 id="nscd-自启动"><code>nscd</code> 自启动</h3>
<div class="outline-text-3" id="text-nscd-自启动">
<pre class="example" id="orgcfe65c6">
systemctl enable nscd
</pre>

<p>
nscd is a daemon that provides a cache for the most common name service
requests. The default configuration file, /etc/nscd.conf, determines the
behavior of the cache daemon.
</p>
</div>
</div>

<div id="outline-container-redshift" class="outline-3">
<h3 id="redshift">redshift</h3>
<div class="outline-text-3" id="text-redshift">
<p>
纬度，经度 115.622324,33.165395
</p>

<pre class="example" id="orgd456569">
mkdir ~/.config/redshift
vim ~/.config/redshift/redshift.conf
</pre>

<p>
<code>~/.config/redshift/redshift.conf</code>:
</p>

<pre class="example" id="orgb482a08">
[redshift]
location-provider=manual
temp-day=5500
temp-night=3700

[manual]
lat=33.165395
lon=115.622324
</pre>

<p>
参考：
</p>

<ol class="org-ol">
<li><a href="https://wiki.archlinux.org/title/redshift">https://wiki.archlinux.org/title/redshift</a></li>
<li><a href="https://io-oi.me/tech/hello-arch-linux/#redshift">https://io-oi.me/tech/hello-arch-linux/#redshift</a></li>
</ol>
</div>
</div>

<div id="outline-container-tldr" class="outline-3">
<h3 id="tldr">tldr</h3>
<div class="outline-text-3" id="text-tldr">
<ol class="org-ol">
<li>tldr-node-client</li>
</ol>

<pre class="example" id="orgc48b608">
npm install -g tldr
cd ~/.nvm/versions/node/v14.18.1/lib/node_modules/tldr
mkdir -p $ZSH_CUSTOM/plugins/tldr
cp bin/completion/zsh/_tldr $ZSH_CUSTOM/plugins/tldr/_tldr
</pre>

<p>
在 <code>~/.zshrc</code> 的 plugins 中加入 tldr。
</p>

<ol class="org-ol">
<li>tldr-python-client</li>
</ol>

<pre class="example" id="orga75c45f">
sudo pacman -S tldr
</pre>

<p>
在 <code>~/.zshrc</code> 中加入以下内容：
</p>

<pre class="example" id="org122afbf">
export TLDR_CACHE_ENABLED=1
export TLDR_CACHE_MAX_AGE=720
export TLDR_PAGES_SOURCE_LOCATION="https://raw.githubusercontent.com/tldr-pages/tldr/master/pages"
export TLDR_DOWNLOAD_CACHE_LOCATION="https://tldr-pages.github.io/assets/tldr.zip"
</pre>
</div>
</div>
</div>
