org/blog/2021/arch-software-installation-and-usage.org
** 让 Arch Linux 系统和最新的镜像同步，从最快的镜像下载[fn:16]
   :PROPERTIES:
   :CUSTOM_ID: 让-arch-linux-系统和最新的镜像同步从最快的镜像下载 16
   :END:
#+begin_example
  #!/bin/bash -e

  unshare -m bash <<'EOF'
  mount --make-rprivate /
  for f in /etc/pacman.d/\*.sync; do

    filename="${f%.\*}"
    mount --bind "$f" "$filename"

  done
  pacman -Sy
  EOF
#+end_example

** 使用国外 DNS 造成国内网站访问慢的解决方法
   :PROPERTIES:
   :CUSTOM_ID: 使用国外-dns-造成国内网站访问慢的解决方法
   :END:
[[https://wzyboy.im/post/874.html]]

#+begin_example
  systemctl status dnsmasq
#+end_example

Output:

#+begin_example
  dnsmasq.service - dnsmasq - A lightweight DHCP and caching DNS server
      Loaded: loaded (/usr/lib/systemd/system/dnsmasq.service; enabled; vendor preset: disabled)
          Active: inactive (dead)

          Docs: man:dnsmasq(8)
#+end_example

=dnsmasq.service: Start request repeated too quickly.=:

The default limit is to allow 5 restarts in a 10sec period. If a service
goes over that threshold due to the =Restart== config option in the
service definition, it will not attempt to restart any further.

ref:

1. [[https://github.com/felixonmars/dnsmasq-china-list]]
2. [[https://serverfault.com/a/845473]]
3. [[https://web.archive.org/web/20191101231638/http://felixc.at:80/Dnsmasq]]

** 备份
   :PROPERTIES:
   :CUSTOM_ID: 备份
   :END:

- [[https://blog.lilydjwg.me/2013/12/29/rsync-btrfs-dm-crypt-full-backup.42219.html]]
- [[https://github.com/teejee2008/timeshift]]

#+begin_example
  sudo pacman -S timeshift
#+end_example

*** timeshift
    :PROPERTIES:
    :CUSTOM_ID: timeshift
    :END:

1. Snapshot type: rsync (btrfs cannot use because of BTRFS snapts are
   saved on system partition)
2. User home directories: root-include all files, user-include only
   hidden files

** 自动更新 hosts GitHub 相关 IP
   :PROPERTIES:
   :CUSTOM_ID: 自动更新-hosts-github-相关-ip
   :END:
ref:

1. [[https://bbs.archlinuxcn.org/viewtopic.php?pid=43366#p43366]]
2. [[https://gist.github.com/lilydjwg/93d33ed04547e1b9f7a86b64ef2ed058]]
3. [[https://github.com/rbew/github-host]]

前提：=/etc/hosts= 文件中要先存在 =github.com=

#+begin_example
  sudo pacman -S python-aiohttp
#+end_example

** Wayland 下的剪切板工具

- https://github.com/bugaevc/wl-clipboard

[fn:1] https://io-oi.me/tech/hello-arch-linux/#隐藏-grub-除非按下-shift-键

[fn:2] https://www.reddit.com/r/linux4noobs/comments/5372gj/disable_arch_linux_grub_boot_menu/d7qjh6s

[fn:3] https://bbs.archlinuxcn.org/viewtopic.php?pid=44067#p44067

[fn:4] https://wiki.archlinux.org/title/reflector

[fn:5] https://cfp.vim-cn.com/cb3wN/python

[fn:6] https://zhuanlan.zhihu.com/p/341637818

[fn:7] https://realdougwilson.com/writing/coding-with-character

[fn:8] https://tonsky.me/blog/cursor-keys/

[fn:9] https://github.com/archlinuxcn/mirrorlist-repo

[fn:10] https://wiki.archlinux.org/title/System_maintenance#Read_before_upgrading_the_system

[fn:11] https://wiki.archlinux.org/title/VirtualBox

[fn:12] https://bbs.archlinuxcn.org/viewtopic.php?pid=45774#p45774

[fn:13] https://wiki.archlinux.org/title/Vagrant

[fn:14] http://www.mutt.org/

[fn:15] https://apps.ankiweb.net/#download

[fn:16] https://blog.lilydjwg.me/2020/10/29/pacsync.215578.html
