blog/2021/arch-software-installation-and-usage.html

<div id="outline-container-让-arch-linux-系统和最新的镜像同步从最快的镜像下载 16" class="outline-2">
<h2 id="让-arch-linux-系统和最新的镜像同步从最快的镜像下载 16">让 Arch Linux 系统和最新的镜像同步，从最快的镜像下载<sup><a id="fnr.16" class="footref" href="#fn.16">16</a></sup></h2>
<div class="outline-text-2" id="text-让-arch-linux-系统和最新的镜像同步从最快的镜像下载 16">
<pre class="example" id="org47469b9">
#!/bin/bash -e

unshare -m bash &lt;&lt;'EOF'
mount --make-rprivate /
for f in /etc/pacman.d/\*.sync; do

  filename="${f%.\*}"
  mount --bind "$f" "$filename"

done
pacman -Sy
EOF
</pre>
</div>
</div>

<div id="outline-container-使用国外-dns-造成国内网站访问慢的解决方法" class="outline-2">
<h2 id="使用国外-dns-造成国内网站访问慢的解决方法">使用国外 DNS 造成国内网站访问慢的解决方法</h2>
<div class="outline-text-2" id="text-使用国外-dns-造成国内网站访问慢的解决方法">
<p>
<a href="https://wzyboy.im/post/874.html">https://wzyboy.im/post/874.html</a>
</p>

<pre class="example" id="org84aea96">
systemctl status dnsmasq
</pre>

<p>
Output:
</p>

<pre class="example" id="org9dc7796">
dnsmasq.service - dnsmasq - A lightweight DHCP and caching DNS server
    Loaded: loaded (/usr/lib/systemd/system/dnsmasq.service; enabled; vendor preset: disabled)
        Active: inactive (dead)

        Docs: man:dnsmasq(8)
</pre>

<p>
<code>dnsmasq.service: Start request repeated too quickly.</code>:
</p>

<p>
The default limit is to allow 5 restarts in a 10sec period. If a service
goes over that threshold due to the <code>Restart=</code> config option in the
service definition, it will not attempt to restart any further.
</p>

<p>
ref:
</p>

<ol class="org-ol">
<li><a href="https://github.com/felixonmars/dnsmasq-china-list">https://github.com/felixonmars/dnsmasq-china-list</a></li>
<li><a href="https://serverfault.com/a/845473">https://serverfault.com/a/845473</a></li>
<li><a href="https://web.archive.org/web/20191101231638/http://felixc.at:80/Dnsmasq">https://web.archive.org/web/20191101231638/http://felixc.at:80/Dnsmasq</a></li>
</ol>
</div>
</div>

<div id="outline-container-备份" class="outline-2">
<h2 id="备份">备份</h2>
<div class="outline-text-2" id="text-备份">
<ul class="org-ul">
<li><a href="https://blog.lilydjwg.me/2013/12/29/rsync-btrfs-dm-crypt-full-backup.42219.html">https://blog.lilydjwg.me/2013/12/29/rsync-btrfs-dm-crypt-full-backup.42219.html</a></li>
<li><a href="https://github.com/teejee2008/timeshift">https://github.com/teejee2008/timeshift</a></li>
</ul>

<pre class="example" id="orgc1e4e23">
sudo pacman -S timeshift
</pre>
</div>

<div id="outline-container-timeshift" class="outline-3">
<h3 id="timeshift">timeshift</h3>
<div class="outline-text-3" id="text-timeshift">
<ol class="org-ol">
<li>Snapshot type: rsync (btrfs cannot use because of BTRFS snapts are
saved on system partition)</li>
<li>User home directories: root-include all files, user-include only
hidden files</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-自动更新-hosts-github-相关-ip" class="outline-2">
<h2 id="自动更新-hosts-github-相关-ip">自动更新 hosts GitHub 相关 IP</h2>
<div class="outline-text-2" id="text-自动更新-hosts-github-相关-ip">
<p>
ref:
</p>

<ol class="org-ol">
<li><a href="https://bbs.archlinuxcn.org/viewtopic.php?pid=43366#p43366">https://bbs.archlinuxcn.org/viewtopic.php?pid=43366#p43366</a></li>
<li><a href="https://gist.github.com/lilydjwg/93d33ed04547e1b9f7a86b64ef2ed058">https://gist.github.com/lilydjwg/93d33ed04547e1b9f7a86b64ef2ed058</a></li>
<li><a href="https://github.com/rbew/github-host">https://github.com/rbew/github-host</a></li>
</ol>

<p>
前提：=/etc/hosts= 文件中要先存在 <code>github.com</code>
</p>

<pre class="example" id="orgb3a56d4">
sudo pacman -S python-aiohttp
</pre>
</div>
</div>

<div id="outline-container-org4f52307" class="outline-2">
<h2 id="org4f52307">Wayland 下的剪切板工具</h2>
<div class="outline-text-2" id="text-org4f52307">
<ul class="org-ul">
<li><a href="https://github.com/bugaevc/wl-clipboard">https://github.com/bugaevc/wl-clipboard</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://io-oi.me/tech/hello-arch-linux/#%E9%9A%90%E8%97%8F-grub-%E9%99%A4%E9%9D%9E%E6%8C%89%E4%B8%8B-shift-%E9%94%AE">https://io-oi.me/tech/hello-arch-linux/#%E9%9A%90%E8%97%8F-grub-%E9%99%A4%E9%9D%9E%E6%8C%89%E4%B8%8B-shift-%E9%94%AE</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.reddit.com/r/linux4noobs/comments/5372gj/disable_arch_linux_grub_boot_menu/d7qjh6s">https://www.reddit.com/r/linux4noobs/comments/5372gj/disable_arch_linux_grub_boot_menu/d7qjh6s</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://bbs.archlinuxcn.org/viewtopic.php?pid=44067#p44067">https://bbs.archlinuxcn.org/viewtopic.php?pid=44067#p44067</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://wiki.archlinux.org/title/reflector">https://wiki.archlinux.org/title/reflector</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="https://cfp.vim-cn.com/cb3wN/python">https://cfp.vim-cn.com/cb3wN/python</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="https://zhuanlan.zhihu.com/p/341637818">https://zhuanlan.zhihu.com/p/341637818</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
<a href="https://realdougwilson.com/writing/coding-with-character">https://realdougwilson.com/writing/coding-with-character</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8">8</a></sup> <div class="footpara"><p class="footpara">
<a href="https://tonsky.me/blog/cursor-keys/">https://tonsky.me/blog/cursor-keys/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.9" class="footnum" href="#fnr.9">9</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/archlinuxcn/mirrorlist-repo">https://github.com/archlinuxcn/mirrorlist-repo</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.10" class="footnum" href="#fnr.10">10</a></sup> <div class="footpara"><p class="footpara">
<a href="https://wiki.archlinux.org/title/System_maintenance#Read_before_upgrading_the_system">https://wiki.archlinux.org/title/System_maintenance#Read_before_upgrading_the_system</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.11" class="footnum" href="#fnr.11">11</a></sup> <div class="footpara"><p class="footpara">
<a href="https://wiki.archlinux.org/title/VirtualBox">https://wiki.archlinux.org/title/VirtualBox</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.12" class="footnum" href="#fnr.12">12</a></sup> <div class="footpara"><p class="footpara">
<a href="https://bbs.archlinuxcn.org/viewtopic.php?pid=45774#p45774">https://bbs.archlinuxcn.org/viewtopic.php?pid=45774#p45774</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.13" class="footnum" href="#fnr.13">13</a></sup> <div class="footpara"><p class="footpara">
<a href="https://wiki.archlinux.org/title/Vagrant">https://wiki.archlinux.org/title/Vagrant</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.14" class="footnum" href="#fnr.14">14</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.mutt.org/">http://www.mutt.org/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.15" class="footnum" href="#fnr.15">15</a></sup> <div class="footpara"><p class="footpara">
<a href="https://apps.ankiweb.net/#download">https://apps.ankiweb.net/#download</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.16" class="footnum" href="#fnr.16">16</a></sup> <div class="footpara"><p class="footpara">
<a href="https://blog.lilydjwg.me/2020/10/29/pacsync.215578.html">https://blog.lilydjwg.me/2020/10/29/pacsync.215578.html</a>
</p></div></div>


</div>
</div></div>
</body>
</html>